[
{
"id": "549ad2ca-2116-11e5-8166-9758cd09ce51",
"created_at": "Sat Aug 01 23:59:09 UTC 2015",
"title": "Head of Business Systems",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>GitHub helps companies and organizations succeed with GitHub so they can build better software, together. We are passionate about helping bring GitHub to companies and organizations all over the world.</p>\n\n<p>The Head of Business Systems will report to the CFO and oversee technology projects, programs, and systems that primarily support our key business functions relating to sales, finance, human resources, and marketing. These systems include employee facing, customer facing, and partner facing business solutions. This role will also work closely with system owners in other departments including security, infrastructure, engineering, and product management to ensure successful integration with, and support of, key business functions.</p>\n\n<p>This strategic role is accountable for driving the creation and selection of internal business systems strategy, technology platform and architecture for key business functions and the overall planning, execution and success of systems projects that impact the entire company.</p>\n\n<p>The ideal candidate will have strong solutions, application, development and project management experience and a general understanding of technical infrastructure.</p>\n\n<h2>Responsibilities</h2>\n\n<ul>\n<li>Grow a multi-functional support and operations team dedicated to the key business systems</li>\n<li>Develop, coordinate and implement plans designed to increase existing business and capture new business opportunities</li>\n<li>Perform evaluation, decision making and purchasing functions on behalf of business groups and company leadership</li>\n<li>Define project budgets, plans and identify interfaces and dependencies within the company</li>\n<li>Direct the use of third-party resources to provide delivery and maintenance of applications and solutions</li>\n<li>Manage the day to day operational relationships with key strategic vendor and outsourced service providers </li>\n<li>Ensure service level agreements are met or exceeded and costs for solutions and services match expected values</li>\n<li>Contribute to the technology decisions, methods, and roadmap for system implementations and integrations</li>\n<li>Direct the maintenance and modification of systems as business requirements evolve while juggling competing stakeholder priorities</li>\n<li>Establish clear, effective evaluation and communication channels and processes within the organization surrounding these business systems</li>\n</ul>\n\n<h2>Qualifications</h2>\n\n<ul>\n<li>10 years experience in project management and/or implementing systems related projects</li>\n<li>Strong problem solving, analytical, planning, and reasoning skills</li>\n<li>Strong financial background and familiarity with purchasing, compliance, audits</li>\n<li>Technical background and understanding of technology architecture, APIs, and integration best practices with experience leading technical team members and vendors</li>\n<li>Strong functional knowledge of data security and risk management concepts</li>\n<li>Experience with B2B and Enterprise products and purchasing flows</li>\n<li>Experience with industry CRMs, ERPs, data warehouses, financial reporting tools</li>\n<li>Experience with international business requirements, policies, and processes</li>\n<li>Proven experience defining and growing systems support a &quot;growth&quot; enterprise product</li>\n<li>Strong leadership, planning and project management skills</li>\n<li>Product management experience, including defining product iterations and roadmaps</li>\n<li>Ability to effectively capture and communicate both high-level vision and detailed requirements from diverse stakeholder and business groups</li>\n<li>Able to coordinate with teams across locations and time zones</li>\n<li>Ability to simultaneously manage multiple projects and timelines at various stages</li>\n<li>Able to handle highly sensitive, confidential, and non-routine information</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<h2>Preferred Qualifications</h2>\n\n<ul>\n<li>Experience with elegant consumer products and purchasing flows</li>\n<li>Experience in management consulting within the financial or software industry</li>\n<li>Complex CRM or ERP implementation experience</li>\n<li>Experience with business solutions including Salesforce, NetSuite, Boomi, GoodData</li>\n<li>Proven strategic thinking, systems thinking and risk management experience</li>\n<li>Executive-level written and verbal communication skills</li>\n<li>Experience working in high-growth environments</li>\n<li>Proven experience with continuous process improvement</li>\n<li>Interested in Git (version control) and GitHub</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n",
"how_to_apply": "<p>Interested? We would love to hear more about you and your interest in being our Head of Business Systems at GitHub! <a href=\"https://jobs.lever.co/github/73350871-ebf1-47ad-8244-f26ca73ef711/apply\">Just fill out our application here</a></p>\n",
"company": "GitHub",
"company_url": "http://www.github.com/about/jobs",
"company_logo": "http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png",
"url": "http://jobs.github.com/positions/549ad2ca-2116-11e5-8166-9758cd09ce51"
},
{
"id": "60b1414e-9768-11e4-9459-580595b8b1d6",
"created_at": "Sat Aug 01 18:58:48 UTC 2015",
"title": "Hiring Coordinator",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>GitHub is looking for a Hiring Coordinator to join our growing HR team to create a smooth, positive interview experience for potential GitHubbers. We value collaboration with others and a fantastic experience for our candidates, so applicants interested in this role should have a passion for creating the best experience possible for others. </p>\n\n<p>Ideal candidates are forward thinking, proactive, and passionate about new ways to improve the overall candidate experience vs. just executing the status quo. Building genuine relationships and trust across GitHub, as well as with our candidates is key to this role. Problem solving skills and the ability to connect dots are also an essential factor to succeeeding as a Hiring Coordinator. </p>\n\n<p>This role is based in San Francisco and will report to the Hiring Manager, working with our Recruiters, Sourcers, and Hiring coordinators to bring the best candidates to GitHub.</p>\n\n<p>Responsibilities will include:</p>\n\n<ul>\n<li>Coordinating and scheduling interviews in-office at San Francisco as well as help with scheduling phone screens and video chats</li>\n<li>Being a friendly, calming guide to candidates on their interview day</li>\n<li>Working with Egencia and the travel team to book travel for candidates flying in from around the country and overseas</li>\n<li>Communicating interview information and travel details with candidates</li>\n<li>Working with our recruiters and hiring managers for each role to optimize the success of their candidates </li>\n<li>Crafting an engaging interview day for each candidate that comes in</li>\n<li>Finding ways to automate and improve manual processes</li>\n<li>Connecting the dots between timelines, people, and preferences to make scheduling a breeze</li>\n<li>Assisting with onsite and external events as needed</li>\n</ul>\n\n<p>Candidates must have:</p>\n\n<ul>\n<li>At least one year of administration or recruiting coordination experience</li>\n<li>Strong written and verbal communication skills</li>\n<li>A customer service mentality</li>\n<li>The ability to partner and work really well with others</li>\n<li>A high level of confidentiality and professionalism</li>\n<li>The ability to be responsive and follow through within a very fast paced environment</li>\n</ul>\n\n<p>Bonus if you have: </p>\n\n<ul>\n<li>Experience working in a start-up environment</li>\n<li>Versatility in doing special assignments &amp; projects as needed</li>\n<li>The initiative to drive innovation within hiring practices</li>\n<li>Knowledge or understanding of employment law, AAP, EEO, diversity initiatives and immigration</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n",
"how_to_apply": "<p>Interested? We&#39;d love to hear more about you and your interest in being a Hiring Coordinator at GitHub! <a href=\"https://jobs.lever.co/github/60f1ce84-e60b-46e2-8d02-42e24d2361c0/apply\">Just submit your application here.</a></p>\n",
"company": "GitHub",
"company_url": "https://github.com/about/jobs",
"company_logo": "http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png",
"url": "http://jobs.github.com/positions/60b1414e-9768-11e4-9459-580595b8b1d6"
},
{
"id": "7b2e2430-e919-11e4-8e97-7960f431f2bc",
"created_at": "Sat Aug 01 18:00:37 UTC 2015",
"title": "Head of Internal Communications",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>GitHub is seeking an experienced internal communications expert to lead the implementation of employee communications programs supporting our strategic business objectives, people-focused culture, and business success. This would be an opportunity to build an internal communications function and team from the ground up, working closely with the VP of Communications and the PR team, as well as HR and Engineering. </p>\n\n<p>Successful candidates will have extensive experience in writing and executing proactive communications plans, developing creative and innovative internal programs and content, and building and fostering relationships across business functions and geographic locations. Candidates should be excellent writers, strategic and creative thinkers, and skilled at managing relationships with leadership. </p>\n\n<p>This role is based in San Francisco with periodic travel opportunities.</p>\n\n<h3>Responsibilities:</h3>\n\n<ul>\n<li>Develop, manage, and execute global internal communication strategies and plans that support GitHub&#39;s vision and goals</li>\n<li>Lead all internal components of company-wide announcements</li>\n<li>Build and drive content for internal events including our weekly all-hands meetings, with a particular focus on remote participation and remote communication needs</li>\n<li>Drive our internal blog strategy</li>\n<li>Develop strategy and content for internal communications tools including our employee intranet</li>\n<li>Be a resource for executives and team leaders when rolling out new policies and other internal announcements</li>\n<li>Monitor employee feedback and topics of discussion to identify communication opportunities</li>\n</ul>\n\n<h3>Qualifications:</h3>\n\n<ul>\n<li>At least 7-10 years of experience in technology communications (internal, PR, or AR), with at least 3 years specifically focused on internal communications</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Exceptional interpersonal communication skills</li>\n<li>Collaborative and team oriented</li>\n<li>Ability to drive consensus across diverse set of stakeholders, including senior leadership</li>\n<li>Ability to support change management in complex, fast changing organizations</li>\n<li>Excellent project management skills and analytical ability</li>\n<li>Interest in Git and GitHub</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<h3>Bonus:</h3>\n\n<ul>\n<li>Experience running internal communications in a growing, fast paced, and/or start-up environment</li>\n<li>Experience with remote communications / working on a highly distributed team </li>\n<li>Experience working in an engineering/developer-centric culture </li>\n<li>Understanding of enterprise software landscape </li>\n<li>PR experience</li>\n<li>Experience using GitHub</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over five million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n",
"how_to_apply": "<p>Interested? We would love to hear more about you and your interest in being our Head of Internal Communications at GitHub! <a href=\"https://jobs.lever.co/github/aecfe900-59b7-4cfd-ba42-76e2db50233b/apply\">Just fill out our application here.</a></p>\n",
"company": "GitHub",
"company_url": "http://www.github.com/about/jobs",
"company_logo": "http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png",
"url": "http://jobs.github.com/positions/7b2e2430-e919-11e4-8e97-7960f431f2bc"
},
{
"id": "74ca0384-1385-11e5-9076-7bc55803e82d",
"created_at": "Sat Aug 01 17:39:21 UTC 2015",
"title": "Deals Desk Manager",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>GitHub is looking for a Deals Desk Manager to join the growing Finance team. As a manager of the deals desk, you will be responsible for providing support to GitHub’s worldwide sales team as well as our finance and legal teams. You’ll be reviewing bookings, generating quotes, and working on proposals to support a large and growing sales team while also ensuring that finance and legal terms are adhered to under company policy. </p>\n\n<p>The objective in this role is to ensure that all sales professionals have 360 degree support, each respective deal is reviewed for any software revenue recognition issues as signed off by our finance team, and that terms and conditions have been reviewed and signed off by our legal team. A customer-centric attitude and the ability to work collaboratively in a fast moving environment is crucial in this role.  </p>\n\n<p>This position is based in San Francisco and reports to the finance team with dotted lines to the sales, sales operations and legal teams.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Develop in-depth knowledge of GitHub’s licensing model, and pricing, to provide quoting support to our worldwide sales teams</li>\n<li>Participate in responding to requests for proposals, and information, from GitHub’s current and prospective customers</li>\n<li>Review and approve bookings submitted in Salesforce.com by the sales team. Review and approval considers any compliance, software revenue recognition or legal issues and working with the respective teams in order to resolve these before deal closure. </li>\n<li>Work across functional areas such as product management, finance, legal and product marketing to enable revenue, and serve both internal stakeholders and customers alike</li>\n<li>Create recommendations on standard deal structure models</li>\n<li>Become a subject matter expert on all those aspects of the sales process that do not directly involve the customer</li>\n<li>Drive enhancements to the quote-to-cash processes and policies</li>\n<li>Become an expert on GitHub’s Salesforce.com instance to effectively support sales’ use of this essential business system</li>\n</ul>\n\n<p>Requirements:</p>\n\n<ul>\n<li>Bachelor’s degree in a related field such as Business, Information Technology, Accounting or Finance</li>\n<li>5+ years of experience in sales, sales operations, accounting or finance</li>\n<li>Understanding of software revenue recognition issues</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<p>Preferred Qualifications:</p>\n\n<ul>\n<li>Background in Enterprise Software</li>\n<li>Experience using Salesforce.com CRM platform and NetSuite</li>\n<li>Experience with licensing / entitlement management</li>\n<li>Proven success in a customer facing sales role</li>\n<li>Comfort in a startup environment</li>\n<li>Strong communication skills, both written and verbal</li>\n<li>Hyper attention to detail</li>\n<li>Effective at time management and prioritization</li>\n<li>The ability to work in a matrix reporting environment to multiple departments</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n",
"how_to_apply": "<p>Interested? We would love to hear more about you and your interest in being our Deals Desk Manager! <a href=\"https://jobs.lever.co/github/e30bc3f5-0f88-4270-95bd-d9d105de4e3e/apply\">Just fill out our application here.</a></p>\n",
"company": "GitHub",
"company_url": "http://www.github.com/about/jobs",
"company_logo": "http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png",
"url": "http://jobs.github.com/positions/74ca0384-1385-11e5-9076-7bc55803e82d"
},
{
"id": "3fa66960-36dd-11e5-88c4-53e7bc1ede88",
"created_at": "Sat Aug 01 17:05:58 UTC 2015",
"title": "Sales Operations Manager",
"location": "San Francisco ",
"type": "Full Time",
"description": "<p>GitHub helps companies and organizations succeed with GitHub so they can build better software, together. Our sales team is passionate about helping bring GitHub to companies and organizations all over the world.</p>\n\n<p>The Sales Operations Manager reports to the Sales Operations Director and focuses on projects, programs, and systems that improve the productivity of the growing sales team. This role also interfaces with other internal groups and stakeholders including finance, marketing, legal and engineering.</p>\n\n<h2>Responsibilities</h2>\n\n<ul>\n<li>Work with sales management to develop and improve processes involving, affecting and supporting the inside and enterprise sales teams</li>\n<li>Proactively identify and explore opportunities for sales process improvements and facilitate implementing changes</li>\n<li>Provide project management support for and advice to sales team leaders to help successfully execute new programs</li>\n<li>Manage a team of professional sales operations individuals</li>\n<li>Assist with sales planning, inclusive of updates to quotas, headcount and sales plan</li>\n<li>Manage sales compensation program including assisting with plan design, CallidusCloud solution and assessing effectiveness of plans based on performance and costs</li>\n<li>Collaborate with marketing and product management in the creation of programs to drive revenue</li>\n<li>Partners with Deals Desk team on sales processes that support complete booking packages</li>\n<li>Maintain and modify sales territories and provide comprehensive analysis of territory alignment decisions</li>\n</ul>\n\n<h2>Qualifications</h2>\n\n<ul>\n<li>3+ years experience in sales operations</li>\n<li>2 years management experience in a business-to-business environment</li>\n<li>Able to work effectively within a sales team environment</li>\n<li>Strong problem solving, analytical, planning, and reasoning skills</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Proven experience handling conflicting priorities</li>\n<li>Proven experience with continuous process improvement</li>\n<li>Able to handle highly sensitive, confidential, and non-routine information</li>\n<li>Able to coordinate with teams across locations and time zones</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<h2>Preferred Qualifications</h2>\n\n<ul>\n<li>Experience in sales operations or management consulting within the software industry</li>\n<li>Knowledge of sales methodologies and sales force automation tools</li>\n<li>Experience working in high-growth environments</li>\n<li>Experience with Salesforce.com</li>\n<li>Business intelligence and reporting experience</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n",
"how_to_apply": "<p>Interested? We would love to hear more about you and your interest in being a Sales Operations Manager at GitHub! <a href=\"https://jobs.lever.co/github/7eafeb62-58fd-4946-8c7d-106c9af2de62/apply\">Just fill out our application here</a></p>\n",
"company": "GitHub",
"company_url": "http://www.github.com/about/jobs",
"company_logo": "http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png",
"url": "http://jobs.github.com/positions/3fa66960-36dd-11e5-88c4-53e7bc1ede88"
},
{
"id": "34288a66-2fc9-11e5-97eb-716c71b8a096",
"created_at": "Sat Aug 01 16:54:51 UTC 2015",
"title": "Sales Development Representative",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>GitHub helps companies and organizations succeed by allowing them to build better software, together. We&#39;re looking for Sales Development Representatives to profile ideal customers and markets for inbound and outbound sales leads and marketing campaigns. We care about customer success and customer service, and we&#39;re extremely passionate about the quality of our work. The ideal candidate will have the aptitude and passion to become a master of GitHub’s product capabilities, underlying technology, and competitive advantages.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Qualify inbound marketing leads for the sales teams</li>\n<li>Work with marketing and sales to execute lead generation campaigns </li>\n<li>Create outbound touches into the market (email, phone, etc) to develop qualified leads</li>\n<li>Works with GitHub tools and technology to pass qualified leads to corporate or enterprise sales and to keep updated prospect forecast of opportunity</li>\n<li>Answers customer business questions and determines if there is (BANT):\n\n<ul>\n<li>Budget for a purchase of GitHub Enterprise</li>\n<li>Authority to purchase GitHub Enterprise</li>\n<li>Need for GitHub Enterprise</li>\n<li>Timing, the need for GitHub Enterprise is imminent (i.e., project needs it)</li>\n</ul></li>\n</ul>\n\n<p>Qualifications:</p>\n\n<ul>\n<li>2-3 years of successful sales experience</li>\n<li>Ability to convey information clearly and analyze customer requirements as needed to help customer make buying decisions</li>\n<li>Strong customer orientation, dedication, and passion for delivering a great customer experience</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Collaborative and team oriented</li>\n<li>Interest in Git and GitHub</li>\n<li>Strong technical aptitude and the ability to become deeply fluent in the GitHub&#39;s technology and the industry</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<p>Preferred Qualifications:</p>\n\n<ul>\n<li>Knowledge of Git and GitHub workflows</li>\n<li>High energy and positive attitude</li>\n<li>Ability to take initiative</li>\n<li>Comfortable working in a fast-paced and dynamic environment</li>\n<li>Flexible (ability to work across different time zones) and able to think quickly</li>\n<li>Willing to go the extra mile with a strong work ethic; self-directed and resourceful</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n",
"how_to_apply": "<p>Interested? We would love to hear more about you and your interest in being an Sales Development Representative at GitHub! <a href=\"https://jobs.lever.co/github/5a8315cb-00e5-4e00-a9b3-bf65e01e1316/apply\">Just fill out our application here.</a></p>\n",
"company": "GitHub",
"company_url": "http://www.github.com/about/jobs",
"company_logo": "http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png",
"url": "http://jobs.github.com/positions/34288a66-2fc9-11e5-97eb-716c71b8a096"
},
{
"id": "b7ddba94-3090-11e5-9504-7d50e4c659bd",
"created_at": "Sat Aug 01 16:43:02 UTC 2015",
"title": "Corporate Sales Representative",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>GitHub helps companies and organizations succeed by allowing them to build better software, together. We&#39;re looking for Corporate Sales Reps to work with our leads and other potential opportunities and assist in the buying process. We care about customer success and customer service, and we&#39;re extremely passionate about the quality of our work. The ideal candidate will have the aptitude and passion to become a master of GitHub’s product capabilities, underlying technology, and competitive advantages. </p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Work all mid-market qualified leads and opportunities</li>\n<li>Primary interface to prospects and customers; assist buying process including answering questions and providing information</li>\n<li>Working with customers to communicate how GitHub Enterprise can fit with their business needs</li>\n<li>Liaison with technical sales team for all technical questions</li>\n<li>Assist with demos and trials</li>\n<li>Providing quotes and negotiating close</li>\n<li>Work with GitHub tools and technology to keep accurate prospect and customer information and forecast information</li>\n</ul>\n\n<p>Qualifications:</p>\n\n<ul>\n<li>3-5 years of successful sales experience </li>\n<li>Strong customer orientation, dedication, and passion for delivering a great customer experience</li>\n<li>Ability to assess customer needs</li>\n<li>Strong presentation skills</li>\n<li>Excellent verbal and written communication skills</li>\n<li>Collaborative and team oriented</li>\n<li>Interest in Git and GitHub</li>\n<li>Strong technical aptitude and the ability to become deeply fluent in the GitHub&#39;s technology and the industry</li>\n<li>Must be legally authorized to work in the United States</li>\n</ul>\n\n<p>Preferred Qualifications:</p>\n\n<ul>\n<li>Knowledge of Git and GitHub workflows</li>\n<li>High energy and positive attitude</li>\n<li>Ability to take initiative</li>\n<li>Comfortable working in a fast-paced and dynamic environment</li>\n<li>Flexible (ability to work across different time zones) and able to think quickly</li>\n<li>Willing to go the extra mile with a strong work ethic; self-directed and resourceful</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n",
"how_to_apply": "<p>Interested? We would love to hear more about you and your interest in being a Corporate Sales Rep at GitHub! <a href=\"https://jobs.lever.co/github/3964dbc3-c27e-4dc9-ad7b-61b025d54fe6/apply\">Just fill out our application here.</a></p>\n",
"company": "GitHub",
"company_url": "http://www.github.com/about/jobs",
"company_logo": "http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png",
"url": "http://jobs.github.com/positions/b7ddba94-3090-11e5-9504-7d50e4c659bd"
},
{
"id": "2159eb66-2117-11e5-9f5b-bc1af301cdf6",
"created_at": "Sat Aug 01 00:04:53 UTC 2015",
"title": "Payroll Analyst",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>GitHub is searching for a Payroll Analyst to support our growing, fast-paced organization. This person will play a significant role in our global payroll operations as well as domestic state and local tax review, ongoing analysis of payment discrepancies, and semi-monthly &amp; monthly payroll reconciliations. A thorough understanding of payroll and accounting is critical in this role.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Manage Global payroll operations</li>\n<li>Prepare and review payment discrepancy analysis. Work with the payroll service to find the cause of payroll discrepancies</li>\n<li>Manage the review of communication portals and provide support for company</li>\n<li>Assist employees on payroll-related inquiries</li>\n<li>Semi-Monthly &amp; Monthly payroll audits. Present an overview of activities, document material changes and when required, work with the finance and accounting to resolve out of balance conditions</li>\n<li>Manage and audit the set up of employees</li>\n<li>Ensures compensation payments and bonuses are paid accurately</li>\n<li>Cross train and support the 401K and benefits portals. Includes non-discrimination testing, plan audit involvement and overall 401K plan maintenance</li>\n<li>Work with other finance/accounting team members on monthly close responsibilities and other payroll needs</li>\n<li>Financial Statement Audit support</li>\n<li>Serve as back-up for payroll responsibilities in other team members absences</li>\n</ul>\n\n<p>Experience/Skills Required:</p>\n\n<ul>\n<li>  4+ years of payroll experience</li>\n<li>  4+ years of accounting/finance experience</li>\n<li>  Knowledge of general payroll practices, IRS and State tax regulations</li>\n<li>  Knowledge of multi state pay related practices specifically (and local ordinances)</li>\n<li>  Proficient working with payroll systems that integrate or interface with other systems (ADP products preferred)</li>\n<li>  Demonstrated ability to identify problems and propose paths to solution</li>\n<li>Skilled with generating ad-hoc reports </li>\n<li>  Must be a team player and be able to support multiple projects simultaneously</li>\n<li>Must be authorized to work in the United States</li>\n</ul>\n\n<h2>About GitHub</h2>\n\n<h3>Who we are</h3>\n\n<p>GitHub is the best place to share code with friends, co-workers, classmates, and complete strangers. Over eight million people use GitHub to build amazing things together. With the collaborative features of GitHub.com, our desktop and mobile apps, and GitHub Enterprise, it has never been easier for individuals and teams to write better code, faster.</p>\n\n<p><a href=\"https://github.com/features/projects\">We have a lot of exciting things to do</a>, and we’re looking for the right people to grow with us!</p>\n\n<h3>Why you should join</h3>\n\n<p>Working at GitHub is, to put it simply, a special slice of the universe. We&#39;re committed to transparency, collaboration, experimentation, and always staying classy. </p>\n\n<p>Because of this unique perspective, we&#39;ve established one of the most flexible and well designed physical workspaces around that encourages you to work as you work best. Right now, over 60% of our employees are based outside of our San Francisco (SOMA) headquarters and work according to how they get their best stuff done. </p>\n\n<p>Ensuring that GitHubbers are healthy, motivated, focused and creative is how GitHub stays awesome. Part of this is ensuring that our <a href=\"https://github.com/about/jobs\">benefits</a>* are out of this world.</p>\n\n<p>In a nutshell, we&#39;ve built and are growing a place where we truly love working, and we think you will too.</p>\n\n<p><em>GitHub is made up of people with many different backgrounds and lifestyles, and we like it that way. We invite applications from people of all stripes. We don&#39;t discriminate against employees or applicants based on gender identity or expression, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences that people imagine to discriminate against one another. Also, if you have a disability, please let us know if there&#39;s anything we can do to make the interview process better for you; we&#39;re happy to accommodate.</em></p>\n\n<p><em>*Please note that benefits vary by country, if you have any questions don&#39;t hesitate to ask your recruiter!</em></p>\n",
"how_to_apply": "<p>Interested? We would love to hear more about you and your interest in being a Payroll Analyst at GitHub! <a href=\"https://jobs.lever.co/github/1e3fb243-3dcd-4b9a-b188-731b641eac22/apply\">Just fill out our application here</a></p>\n",
"company": "GitHub",
"company_url": "http://www.github.com/about/jobs",
"company_logo": "http://github-jobs.s3.amazonaws.com/168d1ca6-dd19-11e2-8a2e-153f588b3d80.png",
"url": "http://jobs.github.com/positions/2159eb66-2117-11e5-9f5b-bc1af301cdf6"
},
{
"id": "dbfc02f2-fd77-11e3-9627-a101934ea25e",
"created_at": "Fri Jul 31 00:38:28 UTC 2015",
"title": "Distributed Systems Engineer (Scala/Spark)",
"location": "San Francisco ",
"type": "Full Time",
"description": "<p>Sharethrough is looking for engineers interested in tackling the problems of building large-scale, distributed- and stream-based processing systems.  As a Distributed Systems Engineer, you’ll work on: </p>\n\n<p>Building fault-tolerant micro-services\nEnhancing a low-latency decisioning engine responsible for complex predictive behavior (at thousands of requests per second)\nA streaming data pipeline supervising millions of daily events</p>\n\n<p>Let’s talk if..</p>\n\n<p>You have experience with delivering multithreaded and/or distributed JVM-based systems.  No experience with Scala?  Come learn!\nYou have experience with Spark and/or Spark Streaming or similar stream-based processing systems.<br>\nExperience with Hadoop-based pipelines, maybe a bit of Cascading or Scalding?  That works too, come give Spark a shot.\nWhat you’re building is as important to you as why you’re building it.  You derive deep satisfaction from participating in the problem and solution design with a diverse group from around the company.</p>\n",
"how_to_apply": "<p><a href=\"https://hire.jobvite.com/j?aj=oiUSZfwN&amp;s=Github\">https://hire.jobvite.com/j?aj=oiUSZfwN&amp;s=Github</a></p>\n",
"company": "Sharethrough",
"company_url": "http://www.sharethrough.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/e75b4770-fd77-11e3-9520-d4df47b4cb3b.jpg",
"url": "http://jobs.github.com/positions/dbfc02f2-fd77-11e3-9627-a101934ea25e"
},
{
"id": "98069614-370c-11e5-9277-e522c8fdd512",
"created_at": "Thu Jul 30 22:46:10 UTC 2015",
"title": "Java Software Engineer - Transcend Insights (Campbell, CA)",
"location": "Campbell, CA",
"type": "Full Time",
"description": "<p>Transcend Insights provides innovative products and solutions that allow different systems to exchange health information, improving patient care, lowering costs and enhancing revenue. Transcend Insights provides technology that makes interoperability a reality. Delivering all of the benefits of connected healthcare using a novel approach that is easy to deploy and manage, scales rapidly and assures compliance. Transcend Insights hospital Gateway and physician HealthDock® appliance work in concert as a completely integrated health information network. Transcend Insights is headquartered in Campbell, Calif. and was acquired by Humana, Inc in October 2012.</p>\n\n<p>Summary of Duties:</p>\n\n<p>Transcend Insights is looking for a Sr. Software Engineer working with the software engineering team to continue to add industry leading features to our flagship product, HealthLogix HIE. </p>\n\n<p>The Sr. Software Engineer will design and develop in a highly collaborative, fast-paced environment. Your role is to design innovative solutions to real problems. You will work closely with product owners, scrum master and other software engineers to develop new product offerings and improve existing ones.</p>\n\n<p>Role Essentials </p>\n\n<p>-Bachelor’s Degree in Computer Science, Information Systems or related field</p>\n\n<p>-Working knowledge of designing, developing and deployment with large scale, service oriented architecture</p>\n\n<p>-Experience with Java and multi-threaded, distributed systems implementation</p>\n\n<p>-Experience with Linux administration, specifically RedHat or CentOS</p>\n\n<p>-RDBMS experience with Oracle and MSSQL; basic understanding of SQL is required</p>\n\n<p>Role Desirables </p>\n\n<p>-Experience in Agile Development environments </p>\n\n<p>-Familiarity with Groovy and Grails (very nice to have)</p>\n",
"how_to_apply": "<p><a href=\"https://humana.taleo.net/careersection/externalus/jobdetail.ftl?lang=en&amp;job=140582\">https://humana.taleo.net/careersection/externalus/jobdetail.ftl?lang=en&amp;job=140582</a></p>\n",
"company": "Transcend Insights",
"company_url": "http://www.transcendinsights.com/",
"company_logo": "/images/modules/company/generic_logo.gif",
"url": "http://jobs.github.com/positions/98069614-370c-11e5-9277-e522c8fdd512"
},
{
"id": "333922b2-36e2-11e5-8a10-24b9031b3778",
"created_at": "Thu Jul 30 17:43:21 UTC 2015",
"title": "Full Stack Hacker",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>Checkr is disrupting the dormant background screening industry and building a global trust and safety platform. Since graduating Y-Combinator in 2014, Checkr’s product has shifted the on-demand economy. We already host an elite roster of customers and partners including Uber, Instacart, Handy, Zenefits, iCracked, Caviar, and more. Checkr is featured in Mary Meeker&#39;s 2015 Internet Trends report <a href=\"http://www.kpcb.com/internet-trends\">http://www.kpcb.com/internet-trends</a> (slide 42). We are looking for highly talented teammates to help us continue our growth.</p>\n\n<p>The Full Stack Hacker will work on cool stuff like micro-services, API design, NLP, OCR and more. Checkr is a collection of small services built on Ruby, Javascript, and a variety of databases and queues. We are excited to welcome new languages and technologies to our stack. Checkr was founded by engineers for engineers; we want to create the best environment for developers to build, learn and love their work.</p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Own the product development of features from ideation, design, implementation, to release</li>\n<li>Build new features for Checkr within the whole web stack from the database to the front end</li>\n<li>Deliver performant, reliable, scalable, and secure code</li>\n<li>Demonstrate expertise in at least one or two areas where you can drive technology (micro-services, front-end, API design, TDD, NLP, infrastructure, open-sourcing tools)</li>\n</ul>\n\n<p><strong>Qualifications:</strong></p>\n\n<ul>\n<li>Proficiency in Ruby or Python, and Javascript</li>\n<li>Knowledge of REST API best practices</li>\n<li>Familiarity with Javascript MVC (Angular, Ember)</li>\n<li>TDD experience</li>\n<li>Bachelor&#39;s degree in engineering</li>\n<li>External API integration experience</li>\n<li>Experience with queueing architectures</li>\n</ul>\n\n<p><strong>Perks:</strong></p>\n\n<ul>\n<li>100% medical, dental and vision coverage</li>\n<li>Unlimited PTO policy</li>\n<li>Gym membership, transportation reimbursements</li>\n<li>Free lunch, dinner, and snacks</li>\n<li>Ground floor opportunity as an early team member to directly shape the direction of the company</li>\n</ul>\n\n<p>Apply at <a href=\"http://grnh.se/i2tvr7\">http://grnh.se/i2tvr7</a></p>\n",
"how_to_apply": "<p>Apply at <a href=\"http://grnh.se/i2tvr7\">http://grnh.se/i2tvr7</a></p>\n",
"company": "Checkr",
"company_url": "https://checkr.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/be46d01c-36e1-11e5-9b87-4825e442f846.png",
"url": "http://jobs.github.com/positions/333922b2-36e2-11e5-8a10-24b9031b3778"
},
{
"id": "05ada202-00da-11e5-977a-e6061e01ca31",
"created_at": "Tue Jul 28 22:56:59 UTC 2015",
"title": "Embedded Software Engineer ",
"location": "Palo Alto, CA. ",
"type": "Full Time",
"description": "<p>Embedded Software Engineer</p>\n\n<p>Mayfield Robotics is creating an adorable robot for the home.  Our team is small but growing quickly.  We need some help to get our amazing and adorable robot designed, built, and shipped.  Specifically, we are looking for an Embedded Software Engineer who has a genuine interest in the ever-changing, fun, and exciting world of robotics!  </p>\n\n<p>Role: As part of our team, you will be responsible for designing, developing, and testing software on our low-cost robot platform.  You will be part of the team that ports, develops, and optimizes core robotics functionality, video streaming, and basic infrastructure on low-cost platforms including ARM processors (running Linux) and potentially IPUs, DSPs, or GPUs.  Additionally, you will be responsible for any necessary kernel modifications, drivers, configuration, and/or processing code for features such as camera modules/imagers and other sensors, Wi-Fi, speakers/microphones, or displays.</p>\n\n<p>Experience with: </p>\n\n<p>C/C++ and Python \nLinux PC and embedded Linux software development \nARM processors\nLow level driver development\nBootloaders\nMemory configuration (eMMC, SD) \nPerformance optimization\nBattery life optimization\nSecurity\nTest software\nCommunication: Wi-Fi, USB, SPI, MIPI, I2C</p>\n\n<p>BS degree is required \nAt least 3 years of of real-world experience </p>\n\n<p>Nice to Have, but not required:</p>\n\n<p>Experience with FPGAs, GPUs, DSPs\nMS degree\nBackground in high-volume production is desirable </p>\n\n<p>To apply: send your resume to <a href=\"mailto:jobs+embeddedsoftware@mayfieldrobotics.com\">jobs+embeddedsoftware@mayfieldrobotics.com</a></p>\n",
"how_to_apply": "<p>To apply: send your resume to <a href=\"mailto:jobs+embeddedsoftware@mayfieldrobotics.com\">jobs+embeddedsoftware@mayfieldrobotics.com</a></p>\n",
"company": "Mayfield Robotics",
"company_url": null,
"company_logo": null,
"url": "http://jobs.github.com/positions/05ada202-00da-11e5-977a-e6061e01ca31"
},
{
"id": "8ab2b03a-3561-11e5-8f89-e7eae6a07449",
"created_at": "Tue Jul 28 22:19:44 UTC 2015",
"title": "Lead Front End Developer (Angular)",
"location": "San Francisco",
"type": "Full Time",
"description": "<p><em>Description:</em><br>\nPartender is adding a Lead Front End Developer to our small, largely democratic engineering team.</p>\n\n<p>The Developer will take lead responsibility for implementing and maintaining our web presence.  The Developer will work independently to communicate, understand, plan, and execute projects from beginning to end.  The Developer will always strive to create functional, elegant, well-documented code.</p>\n\n<p>This is an opportunity to play a key role in an early stage company.  The Developer will work with the CEO, Product Manager, and other stakeholders to define the product and plan execution.  The Developer will pair with a designer on user experience, interface design, motion design, and creation of graphic assets.  The Web Developer will coordinate with backend engineers to define API functionality.</p>\n\n<p><em>Requirements:</em></p>\n\n<ul>\n<li>5+ years experience in developing web applications with HTML5, CSS, and JavaScript.</li>\n<li>Strong working experience with Angular JS and RESTful application design.</li>\n<li>Proven track record of independently leading and completing projects.</li>\n<li>Bonus points for experience with Git, Python, Django, and agile methodologies.</li>\n</ul>\n\n<p><em>About Partender:</em><br>\nPartender provides a novel solution for quickly and accurately counting bar inventory.  We have a quickly growing revenue base fueled by tons of sales hustle and featured appearances on the television show Bar Rescue.  In addition to attracting interest from restaurant chains, casinos, hotels, and cruise lines, we have attracted backing from the brilliant, influential minds behind successes like Facebook, Google, and Uber.  Bar inventory is just the starting point to a much deeper strategy.</p>\n\n<p>Partender is a 500 Startups alumnus with a beautiful, fun, dog-friendly office space at Galvanize, a vibrant startup community in San Francisco’s SOMA neighborhood.</p>\n\n<p>Please contact:\n<a href=\"mailto:jobs+web-lead@partender.com\">jobs+web-lead@partender.com</a></p>\n",
"how_to_apply": "<p><a href=\"mailto:jobs+web-lead@partender.com\">jobs+web-lead@partender.com</a></p>\n",
"company": "Partender",
"company_url": "http://www.partender.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/82635650-3561-11e5-874f-05399be4a27a.png",
"url": "http://jobs.github.com/positions/8ab2b03a-3561-11e5-8f89-e7eae6a07449"
},
{
"id": "2d42b77e-34f3-11e5-996b-8b8a13940da8",
"created_at": "Tue Jul 28 06:37:54 UTC 2015",
"title": "Backend Engineer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>Are you ready to do the best work of your life in a truly dynamic, creative environment?  And how about if that work has the ability to impact over 600 million gamers?</p>\n\n<p>The Unity Cloud Analytics team is the global leader in predictive marketing and data science for games and apps. Unity Analytics has captured deep dynamic user behaviors across over 300 million user profiles, and enables leading apps and games to retain, monetize, and personalize the app experience for all users.  Empowering game developers from indie to enterprise is our core focus. Together, we’ll work to provide a global cloud-based platform that enables developers to better connect with their audience, optimize their players’ experience, and discover the right players for their games.  </p>\n\n<p>As a Backend Engineer on the Unity Cloud Analytics team you will help to collect and analyze data from hundreds of millions of Unity game players. You’ll work to design, implement, test and maintain Unity’s platform and services that are capable of handling real time and batch processing of thousands of requests and daily events.  In addition, you’ll write high quality code that supports product functionality, to help build and/or maintain big data systems. </p>\n\n<p>You are a software engineer who knows all about how to capture and make sense of massive amounts of information. Passionate about how analytics can improve decision making to empower game developers, you love data science, and ideally have the following experience:  </p>\n\n<ul>\n<li>5 yrs of professional programming experience in Java</li>\n<li>2 yrs experience processing data at scale using Hadoop</li>\n<li>Solid understanding of systems and resource management</li>\n</ul>\n\n<p>We are looking for driven, creative, smart, funny, earnest and ebullient believers. To thrive here, you need to believe in Unity’s purpose: to develop, sell and spread the news about Unity’s democratizing ecosystem of game development technology and tools, ready-made assets and services, learning resources and Community.</p>\n\n<p>At Unity, we combine creative dynamism with a deep focus on and commitment to quality. We take the time to do our work well. Unity is used for a huge range of tasks by millions of people. So we build it to last; to be robust, resilient and high-performing. Come with your great ideas and expect them to be challenged. Here at Unity we practice intellectual Darwinism, in which anyone can have their say, and the best ideas win in a fair fight.</p>\n\n<p>So if you’re ready to do the best work of your life while impacting hundreds of million gamers, get in touch today.</p>\n",
"how_to_apply": "<p>Please apply <a href=\"https://hire.jobvite.com/CompanyJobs/Careers.aspx?c=qx29Vfwn&amp;jvprefix=http%3a%2f%2funity3d.com&amp;jvresize=frameresize.htm&amp;v=1&amp;page=Apply&amp;j=ot4w0fwN\">here</a>.</p>\n",
"company": "Unity Technologies",
"company_url": "https://unity3d.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/281aa2e8-34f3-11e5-9fe2-adb6d8e88669.png",
"url": "http://jobs.github.com/positions/2d42b77e-34f3-11e5-996b-8b8a13940da8"
},
{
"id": "df402ff4-34a5-11e5-98c2-8022aac2978f",
"created_at": "Mon Jul 27 21:24:32 UTC 2015",
"title": "Senior Product Designer",
"location": "San Francisco, CA, US",
"type": "Full Time",
"description": "<p><p>Radius is hiring Senior Product Designer to join our growing team. As a Product Designer at Radius, your job will be to design and craft interactions for the Radius product. This includes product definition, concept sketching, wire framing, and prototyping—both UX and UI. At Radius, rather than hiring for specific UX vs UI roles, we hire product design generalists. We believe that UX is a team sport that spans product engineering, product management, and product design. Because of this, we&#39;re looking for a special breed of designer who’s capabilities include both UX conception as well as UI execution.</p><p> </p><p>Responsibilities</p><ul> <li>Creation of sketches, wireframes, and user-flow diagrams based on project goals</li>    <li>Design elegant User Interfaces that execute on UX requirements </li>   <li>Follow brand identity guidelines in product designs</li>    <li>Explore and incorporate new and emerging design trends</li> <li>Analyze user behavior and recommend suggestions to the product experience</li>  <li>Collaborate with product managers, engineers, and data scientists</li>  <li>Deliver on polished designs with usable project assets</li></ul><p> </p><p>Requirements</p><ul>    <li>Intuitive ability to create amazing user experiences</li>   <li>Understanding of best-practices in UI/UX design</li>    <li>Obsessive attention to detail</li>  <li>Ablility to analyze, optimize, and simplify workflows</li>  <li>Ability to effectively communicate with other team members</li> <li>Ability to brainstorm, sketch, wireframe, and prototype product designs</li>    <li>Portfolio of past work showcasing job requirements</li> <li>Experience with visual prototyping tools such as InVision</li>  <li>Understanding of HTML, CSS, and other web technologies</li></ul><p> </p><p>Highlights</p><ul>  <li>Design is core to our company and our founders have design backgrounds</li> <li>The SaaS technology space is ripe for disruption by amazing product design</li> <li>We&#39;ve been listed as a breakout tech company and are growing like crazy</li></ul><p> </p><p>Perks</p><ul>  <li>Highly Competitive Salary</li>  <li>Company 401K Plan</li>  <li>Health, Dental, Life Insurance</li> <li>Great office in downtown San Francisco (just one block from BART)</li>  <li>Casual work environment (suit &amp; tie not required)</li>  <li>Flexible time-off policy</li>   <li>Daily lunch and breakfast</li></ul> <img src=\"https://www.applytracking.com/track.aspx/6SQDL\"/></p>\n",
"how_to_apply": "<p><a href=\"https://www.applytracking.com/track.aspx/6SQDp\">https://www.applytracking.com/track.aspx/6SQDp</a></p>\n",
"company": "Radius",
"company_url": null,
"company_logo": null,
"url": "http://jobs.github.com/positions/df402ff4-34a5-11e5-98c2-8022aac2978f"
},
{
"id": "f5c5b9a4-347f-11e5-868f-3f1e56d93e20",
"created_at": "Mon Jul 27 16:53:48 UTC 2015",
"title": "Site Reliability Engineer (Public Cloud SRE)",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>Twitter is looking for a Site Reliability Engineer to join the Public Cloud SRE team dedicated to expanding our infrastructure, automation, and tooling for Public Cloud Infrastructure (e.g. AWS, GCP, Rackspace).</p>\n\n<h1>Responsibilities</h1>\n\n<ul>\n<li>Build automation and tooling in Python</li>\n<li>Perform deep dives into partner teams infrastructure</li>\n<li>Partner with teams from across the organization to help solve tough problems</li>\n<li>Drive standardization efforts across multiple disciplines</li>\n</ul>\n\n<h1>Requirements</h1>\n\n<ul>\n<li>Experience with Linux or Unix</li>\n<li>An understanding and interest in systems and application design</li>\n<li>Practical knowledge of various aspects of service design, including messaging protocols &amp; behavior, caching strategies and software design practices</li>\n<li>Practical knowledge of shell scripting and at least one higher-level language</li>\n<li>Ability to prioritize tasks and work independently</li>\n<li>Must be adaptable and able to focus on the simplest, most efficient &amp; reliable solutions</li>\n<li>Excellent written communication, interpersonal communication, and documentation skills</li>\n</ul>\n\n<h1>Desired</h1>\n\n<ul>\n<li>Public Cloud experience with AWS, GCP, or Rackspace</li>\n<li>Advanced practical knowledge of Python or Ruby</li>\n<li>Functional knowledge of bootstrapping tools such as PXE or cloud-init</li>\n<li>Experience with configuration management tools such as Puppet, Chef, or Ansible</li>\n</ul>\n",
"how_to_apply": "<p>Apply through Jobvite: <a href=\"https://hire.jobvite.com/j?cj=oahr1fwD&amp;s=Drew-Github\">https://hire.jobvite.com/j?cj=oahr1fwD&amp;s=Drew-Github</a></p>\n",
"company": "Twitter, Inc.",
"company_url": "http://twitter.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/da5d8d04-347f-11e5-84d4-c4124bd82f6d.png",
"url": "http://jobs.github.com/positions/f5c5b9a4-347f-11e5-868f-3f1e56d93e20"
},
{
"id": "fa547ace-346f-11e5-9a4e-74a124898d6c",
"created_at": "Mon Jul 27 14:59:31 UTC 2015",
"title": "Tech Lead (Front End Enginering)",
"location": "Palo Alto CA",
"type": "Full Time",
"description": "<p>TECH LEAD (FRONT END ENGINEERING)</p>\n\n<p>Company and Product:</p>\n\n<p>At BitGo, our mission is to secure the world’s bitcoin. Our platform is used by some of the largest institutions and enterprises in the bitcoin space today, and our brand is known as the gold standard for security. We have raised $14 million in venture capital financing from some of the top investors in Silicon Valley, New York, who have backed successful companies like PayPal, Netscape, Red Hat, Proofpoint, Verisign, Juniper Networks, Yammer and Tesla\n. \nOur Founders:</p>\n\n<p>Mike Belshe is a veteran technologist who invented the multi-signature protocols used at Bitgo. Prior, Mike worked at Google on the founding of Google Chrome, was the co-inventor and driving force behind SPDY (which has now become HTTP/2.0 and co-founded Lookout Software acquired by Microsoft.</p>\n\n<p>Ben Davenport is a technology entrepreneur and investor who had been deeply involved in Bitcoin since 2011.  He co-founded Beluga which was sold to Facebook.  Prior, Ben worked at Google and Microsoft.</p>\n\n<p>Why Join Bitgo? </p>\n\n<p>Building disruptive products takes vision, innovation, passion, technical chops, drive to deliver, collaboration and execution. In a nutshell great people, who strive for excellence in all their endeavors who have a track of success!  We are looking for candidates who “think out of the box”, are not risk adverse and want to build products that change the world. We aspire to provide a working environment, culture and leadership team that inspires greatness on a daily basis offering transparency, ownership and integrity.</p>\n\n<p>Join a team and learn about state-of-the-art front end security operational security, backend security for RESTful APIs, and more.  We build layers of security protection with isolated privileges combined with state-of-the-art monitoring a</p>\n\n<p>WHAT YOU WILL OWN IN THIS ROLE:</p>\n\n<p>● We are looking for an individual to lead the development of our flagship product.  The ideal candidate will have prior experience in being part of, and leading, a front-end development team in a fast-paced, creative-focused environment. You should have the ability to learn and take action quickly, have a keen eye for detail, be excellent at solving creative challenges, use data-driven decision making, and never be one to settle for anything less than perfection.<br>\n● In this role, you will be reporting directly to the CEO.\n● Lead a team of developers (Front-End / UI) as well as contributing as a hands-on front end developer\n● Act as the primary technical point of contact\n● Work closely with developers to detect issues and refine development process to meet project needs.\n● Assess and communicate status, issues, risks, and successes\n● Ensure products are delivered to specifications on time\n● Forecast technical resource needs and work closely with the CEO and CTO to fill those needs</p>\n\n<p>WHAT YOU WILL NEED TO BE SUCCESSFUL:</p>\n\n<p>● 5+ years of experience as a front-end developer\n● 2+ years of experience as a technical lead or manager\n● In-depth knowledge and experience developing client-side interfaces using Javascript, HTML5 and CSS and angular.js.\n● Excellent verbal and written communication skills\n● Experience working closely with developers and business stakeholders\n● Excellent organization, time-management, and negotiation skills\n● Ability to be a leader within the team as well as someone who is able to represent the team within the client organization\n● BS in CS preferred.</p>\n\n<p>Benefits:</p>\n\n<ul>\n<li>Comprehensive medical, dental and vision plans</li>\n<li>Exciting startup atmosphere in great downtown office space in Palo Alto (California Ave)</li>\n<li>Catered lunches, fresh snacks and gourmet coffee</li>\n<li>Commuting made easy with company-paid Caltrain passes and MiFi connectivity</li>\n<li>Computer equipment and workplace furniture to suit your needs</li>\n<li>Flexible vacation time</li>\n<li>Great coworkers!</li>\n</ul>\n",
"how_to_apply": "<p>email resume to: <a href=\"mailto:andree@bitgo.com\">andree@bitgo.com</a></p>\n",
"company": "Bitgo, Inc",
"company_url": "http://www.bitgo.com",
"company_logo": null,
"url": "http://jobs.github.com/positions/fa547ace-346f-11e5-9a4e-74a124898d6c"
},
{
"id": "37f005f6-e772-11e4-95fc-5308912c3a45",
"created_at": "Sun Jul 26 15:22:35 UTC 2015",
"title": "Senior Mobile Android Engineer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>Purpose, mastery and autonomy. We provide all three at Rally Health (rallyhealth.com), a startup that&#39;s revolutionizing health and the face of health care. Join a passionate mobile team on a mission to empower millions of users to improve wellness and lifestyles through devices they use every day.</p>\n\n<p>We are looking for someone to join us and make an impact right now as we prepare to launch a full blown suite of apps on the mobile platform. If you are fascinated by mobile and its endless possibilities, come join us!</p>\n\n<p><strong>Things you’re excited about:</strong></p>\n\n<ul>\n<li>Android development</li>\n<li>Building products that delight millions of users</li>\n<li>Continuously improving user experience </li>\n<li>Joining a team built on a foundation of collaboration and respect</li>\n</ul>\n\n<p><strong>You have experience with:</strong></p>\n\n<ul>\n<li>Java</li>\n<li>Android development</li>\n<li>Server integration (REST endpoints)</li>\n<li>Released at least one app on the Google Play store</li>\n<li>BS, MS or PhD in Computer Science or related field</li>\n</ul>\n\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records</p>\n",
"how_to_apply": "<p><a href=\"http://grnh.se/tokxc7\">Apply here</a></p>\n",
"company": "Rally Health",
"company_url": "http://www.rallyhealth.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/31390d16-e772-11e4-8f0e-d52b476f87da.png",
"url": "http://jobs.github.com/positions/37f005f6-e772-11e4-95fc-5308912c3a45"
},
{
"id": "8c93a3a6-3245-11e5-9a7d-780c7565f015",
"created_at": "Fri Jul 24 20:51:05 UTC 2015",
"title": "Computer Science Curriculum Engineer",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>Make School is building the <a href=\"https://www.makeschool.com/news/the-product-university\">Product University</a> for aspiring software engineers and founders. Students spend two years learning computer science foundations, software engineering and product development through a blend of individually paced, project-based learning and industry experience. <a href=\"https://makegameswithus.hackpad.com/Make-School-Curriculum-Outline-R3tj9xUaOM2\">Here&#39;s more detail on the curriculum.</a> Unlike traditional university, students have <strong>zero upfront cost</strong> for the program; they pay tuition through future earnings.</p>\n\n<p>Our pilot class built products featured in Huffington Post and Buzzfeed and graduated onto software engineering jobs at companies like Snapchat, Pandora and Edmodo. Prospective students have already shipped dozens of apps, worked on linux distributions and interned at YC startups. Some are applying to transfer from top colleges like MIT, Berkeley and Columbia, others weren&#39;t able to attend college for financial reasons.</p>\n\n<p>We&#39;re looking for a CS Curriculum Engineer to develop and teach the computer science curriculum. It will cover the basics of algorithms and data structures through advanced topics such as machine learning and artificial intelligence. Your work will serve as the foundation for the Make School educational experience as we scale from 50 students to 5,000 students and beyond. By joining our early team of Curriculum Engineers, you’ll be creating the blueprint for the future of higher education.</p>\n\n<p>Our curriculum will eventually be open sourced - parts of it are already used by MIT and Carnegie Mellon as well as tens of thousands of students online. You’ll have the unique opportunity to engage and inspire talented young software engineers face to face while also impacting millions of aspiring developers around the world.</p>\n\n<p>What you’ll do:</p>\n\n<ul>\n<li>Build and deliver the Make School&#39;s computer science curriculum</li>\n<li>Teach fundamental computer science concepts (data structures, algorithms) as well as more advanced topics (machine learning, AI)</li>\n<li>Spend 40% of your time time in the classroom, helping students with projects and identifying areas of need</li>\n<li>Spend 30% of your time working with the Curriculum team building and updating content</li>\n<li>Spend 30% of your time working on open source projects, attending hackathons, building internal tools, etc.</li>\n</ul>\n\n<p>We are looking for CS Curriculum Engineers with:</p>\n\n<ul>\n<li>Passion for teaching and mentoring developers</li>\n<li>A <strong>strongly</strong> held belief that students learn best through guided, hands on experience</li>\n<li>Industry experience building and maintaining large scale products</li>\n<li>Good understanding of core CS principles and concepts (data structures, algorithms)</li>\n<li>Experience working with or teaching advanced CS concepts (machine learning, computer vision, artificial intelligence)</li>\n<li>Experience with the application of math principles (calculus, statistics) </li>\n<li>Made positive impacts on your team(s)</li>\n</ul>\n\n<p>About the Make School team - since 2012 we’ve taught over 750 students through in person courses and over a million students through online tutorials. We’ve grown to 16 people who joined the company from Hawaii, Michigan, Boston, Ohio and Germany. We’ve previously worked at startups, small businesses, game companies and tech companies. We’ve lectured and taught at MIT, Carnegie Mellon, UC Berkeley, Stanford and INSEAD. We frequently volunteer to teach beginners coding basics and mentor entrepreneurs building companies. We see each other as a family and work to treat each other better everyday. Our culture is fast paced yet fun and forgiving. We care deeply about improving computer science education, and sparking passion in students to build products.</p>\n",
"how_to_apply": "<p>If you&#39;re interested, send us an email to <a href=\"mailto:jobs@makeschool.com\">jobs@makeschool.com</a> along with your resume. Thanks!</p>\n",
"company": "Make School",
"company_url": "http://www.makeschool.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/790aee20-3245-11e5-9d99-74542bbce49c.png",
"url": "http://jobs.github.com/positions/8c93a3a6-3245-11e5-9a7d-780c7565f015"
},
{
"id": "9b39dd04-3244-11e5-9bb7-2ed9114968f0",
"created_at": "Fri Jul 24 20:44:28 UTC 2015",
"title": "Rails Curriculum Engineer",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>Make School is building the <a href=\"https://www.makeschool.com/news/the-product-university\">Product University</a> for aspiring software engineers and founders. Students spend two years learning computer science foundations, software engineering and product development through a blend of individually paced, project-based learning and industry experience. <a href=\"https://makegameswithus.hackpad.com/Make-School-Curriculum-Outline-R3tj9xUaOM2\">Here&#39;s more detail on the curriculum.</a> Unlike traditional university, students have <strong>zero upfront cost</strong> for the program; they pay tuition through earnings.</p>\n\n<p>Our pilot class built products featured in Huffington Post and Buzzfeed and graduated onto software engineering jobs at companies like Snapchat, Pandora and Edmodo. Prospective students have already shipped dozens of apps, worked on linux distributions and interned at YC startups. Some are applying to transfer from top colleges like MIT, Berkeley and Columbia, others weren&#39;t able to attend college for financial reasons.</p>\n\n<p>We&#39;re looking for a Curriculum Engineer to develop and teach the web development curriculum. Your work will serve as the foundation for the Make School educational experience as we scale from 50 students to 5,000 students and beyond. By joining our early team of Curriculum Engineers, you’ll be creating the blueprint for the future of higher education.</p>\n\n<p>Our curriculum will eventually be open sourced - parts of it are already used by MIT and Carnegie Mellon as well as tens of thousands of students online. You’ll have the unique opportunity to engage and inspire talented young software engineers face to face while also impacting millions of aspiring developers around the world.</p>\n\n<p>What you’ll do:</p>\n\n<ul>\n<li>Build and deliver the Make School&#39;s web development curriculum</li>\n<li>Teach core web technologies (e.g. Ruby on Rails, databases, JavaScript, HTML, CSS), fundamental computer science concepts, and development practices (e.g. design patterns, prototyping)</li>\n<li>Spend 40% of your time time in the classroom, helping students with projects and identifying areas of need</li>\n<li>Spend 30% of your time working with the Curriculum team building and updating content</li>\n<li>Spend 30% of your time working on open source projects, attending hackathons, building internal tools, etc.</li>\n</ul>\n\n<p>We are looking for Rails Curriculum Engineers with:</p>\n\n<ul>\n<li>Passion for teaching and mentoring developers</li>\n<li>A <strong>strongly</strong> held belief that students learn best through guided, hands on experience</li>\n<li>Industry experience building and maintaining large scale products</li>\n<li>Experience building apps using web development technologies, especially modern JavaScript and Ruby on Rails</li>\n<li>Good understanding of CS principles and concepts (data structures, algorithms)</li>\n<li>Good understanding of development best practices (TDD, version control, design patterns, performance)</li>\n<li>A positive impact on the people around you</li>\n</ul>\n\n<p>About the Make School team - since 2012 we’ve taught over 750 students through in person courses and over a million students through online tutorials. We’ve grown to 16 people who joined the company from Hawaii, Michigan, Boston, Ohio and Germany. We’ve previously worked at startups, small businesses, game companies and tech companies. We’ve lectured and taught at MIT, Carnegie Mellon, UC Berkeley, Stanford and INSEAD. We frequently volunteer to teach beginners coding basics and mentor entrepreneurs building companies. We see each other as a family and work to treat each other better everyday. Our culture is fast paced yet fun and forgiving. We care deeply about improving computer science education, and sparking passion in students to build products.</p>\n",
"how_to_apply": "<p>If you&#39;re interested, send us an email to <a href=\"mailto:jobs@makeschool.com\">jobs@makeschool.com</a> along with your resume. Thanks!</p>\n",
"company": "Make School",
"company_url": "http://www.makeschool.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/694262da-3244-11e5-87b1-70f63848be5c.png",
"url": "http://jobs.github.com/positions/9b39dd04-3244-11e5-9bb7-2ed9114968f0"
},
{
"id": "488d58f2-3243-11e5-853c-456fd95bdb01",
"created_at": "Fri Jul 24 20:36:51 UTC 2015",
"title": "iOS Curriculum Engineer",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>Make School is building the <a href=\"https://www.makeschool.com/news/the-product-university\">Product University</a> for aspiring software engineers and founders. Students spend two years learning computer science foundations, software engineering and product development through a blend of individually paced, project-based learning and industry experience. <a href=\"https://makegameswithus.hackpad.com/Make-School-Curriculum-Outline-R3tj9xUaOM2\">Here&#39;s more detail on the curriculum</a>. Unlike traditional university, students have <strong>zero upfront cost</strong> for the program; they pay tuition through future earnings.</p>\n\n<p>Our pilot class built products featured in Huffington Post and Buzzfeed and graduated onto software engineering jobs at companies like Snapchat, Pandora and Edmodo. Prospective students have already shipped dozens of apps, worked on linux distributions and interned at YC startups. Some are applying to transfer from top colleges like MIT, Berkeley and Columbia, others weren&#39;t able to attend college for financial reasons.</p>\n\n<p>We&#39;re looking for a iOS Curriculum Engineer to develop and teach the computer science curriculum. It will cover iOS (Swift and Objective-C), Node.js and MongoDB. Your work will serve as the foundation for the Make School educational experience as we scale from 50 students to 5,000 students and beyond. By joining our early team of Curriculum Engineers, you’ll be creating the blueprint for the future of higher education.</p>\n\n<p>Our curriculum will eventually be open sourced - parts of it are already used by MIT and Carnegie Mellon as well as tens of thousands of students online. You’ll have the unique opportunity to engage and inspire talented young software engineers face to face while also impacting millions of aspiring developers around the world.</p>\n\n<p>What you’ll do:</p>\n\n<ul>\n<li>Build and deliver the Make School&#39;s iOS curriculum</li>\n<li>Teach core iOS technologies (Swift, Objective-C)</li>\n<li>Spend 40% of your time time in the classroom, helping students with projects and identifying areas of need</li>\n<li>Spend 30% of your time working with the Curriculum team building and updating content</li>\n<li>Spend 30% of your time working on open source projects, attending hackathons, building internal tools, etc.</li>\n</ul>\n\n<p>We are looking for CS Curriculum Engineers with:</p>\n\n<ul>\n<li>Passion for teaching and mentoring developers</li>\n<li>A <strong>strongly</strong> held belief that students learn best through guided, hands on experience</li>\n<li>Industry experience building and maintaining iOS apps, using either Objective-C or Swift</li>\n<li>Good understanding of CS principles and concepts (data structures, algorithms)</li>\n<li>Good understanding of development best practices (TDD, version control, design patterns, performance)</li>\n<li>A positive impact on the people around you</li>\n</ul>\n\n<p>About the Make School team - since 2012 we’ve taught over 750 students through in person courses and over a million students through online tutorials. We’ve grown to 16 people who joined the company from Hawaii, Michigan, Boston, Ohio and Germany. We’ve previously worked at startups, small businesses, game companies and tech companies. We’ve lectured and taught at MIT, Carnegie Mellon, UC Berkeley, Stanford and INSEAD. We frequently volunteer to teach beginners coding basics and mentor entrepreneurs building companies. We see each other as a family and work to treat each other better everyday. Our culture is fast paced yet fun and forgiving. We care deeply about improving computer science education, and sparking passion in students to build products.</p>\n",
"how_to_apply": "<p>If you&#39;re interested, send us an email to <a href=\"mailto:jobs@makeschool.com\">jobs@makeschool.com</a> with a copy of your resume. Thanks!</p>\n",
"company": "Make School",
"company_url": "http://www.makeschool.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/6c3c49e0-3232-11e5-974f-266162b4ccaf.png",
"url": "http://jobs.github.com/positions/488d58f2-3243-11e5-853c-456fd95bdb01"
},
{
"id": "2bda413e-313a-11e5-9fa0-cf372b1e2c98",
"created_at": "Thu Jul 23 12:56:44 UTC 2015",
"title": "IT DevOps Engineer",
"location": "Redwood City, California",
"type": "Full Time",
"description": "<p><p><strong>IT DevOps Engineer</strong></p> <p><strong><a href=\"https://hire.jobvite.com/j?cj=ot8i0fwD&s=td\">Apply Now!</a><br /></strong></p> <p>In this role your voice will be heard and you’ll be the specialist for mission-critical decisions. You will be the defender of excellence in implementation/improvement of software development practices, release management methodologies and software deployment strategies, optimizing and fine tuning for best &#39;uptime&#39; and performance.<br /><strong><br />How you will spend your time:</strong></p> <ul> <li>Deploying Bina’s product on customer sites or on the cloud (AWS).</li> <li>Manage all managed services, things like managing google accounts, github, amazon, building stuff around it that makes it more consistent and less manual – more automated.</li> <li>Building monitoring tools for things we use internally or are putting out in the field.</li> <li>Monitor performance characteristics on a regular basis and implement configuration change that provides consistent performance with an eye for scale.</li> <li>Developing deployment and monitoring tools to improve the product maintainability and reliability.</li> <li>Escalating customer’s technical product issues to the engineering team for troubleshooting and resolution.</li> <li>Participating in product design and development, customer training, support, and sales activities as needed.</li> </ul> <br /> <p><strong><strong>Experience and skills you will need:</strong></strong></p> <ul> <li>Are you a Generalist to an extreme? Yes? This is ideal.</li> <li>Is this personal to you? Because you will need passion to learn fast and embrace the opportunity to build superb software products for genome and cancer analysis.</li> <li>You will need to understand programming and be able to think like a developer.  WWADD? (what would a developer do?) ...At the same time you will need to do a fair amount of what is generally considered to be IT and SysAdmin, debug network issues, storage issues, operating systems – and be moderately advanced across all three systems.</li> <li>Fluency at system-level with mainstream Linux distributions (Debian or Ubuntu preferred).</li> <li>Ability to script in your sleep in at least one scripting/software language (Bash, Python, perl, Java).</li> <li>Solid understanding of networking fundamentals gained through hands management of network, server, storage and operating systems.</li> <li>Veteran level expertise with Amazon cloud (AWS) environment, utilities, and tools.</li> <li>Solid experience working with complex software products like databases, application servers, distributed systems, etc., with the ability to read logs and troubleshoot issues.</li> <li>Highly motivated with the ability to work independently and in a team environment.</li> <li>3-6 years in Systems Engineering/DevOps role</li> <li>Bachelor’s degree in computer science or a related field</li> </ul> <p><span><strong><br /></strong></span></p> <p><span><strong>About Us</strong></span></p> <p><span>We code to cure! At Bina, we have a passion for improving lives by accelerating the science of personalized medicine. This is where Life Science meets Computer Science.</span></p> <p><span><br /></span></p> <p><span>The science of interpreting the human genome is an exciting work in progress. Next-generation sequencing and genomic technologies are providing us with unprecedented visibility into the origins of health and disease. However, the main challenge is enabling the analysis and management of massive datasets being produced by scientists and researchers around the world.</span></p> <p><span><br /></span></p> <p><span>At Bina, we are dedicated to tackling this challenge every day. We know the ability to analyze and manage these datasets will revolutionize how we diagnose disease, develop drugs, and treat patients, especially in complex cases such as cancer.</span></p> <p><span><br /></span></p> <p><span>Watch our code2cure meetup presentation and slide deck </span><a href=\"http://www.slideshare.net/amirhkiani/code2cure\" target=\"_blank\"><strong><span>her</span>e</strong></a></p> <br /> <p><span>With a strong interdisciplinary knowledge in science and technology, we are elevating the speed and quality  of genomic analysis, bringing us one step closer to solutions that will change and save lives.</span></p> <p><span>Headquartered in Redwood City, California, Bina Technologies was recently acquired by Hoffmann-La Roche and now is part of Roche Sequencing.</span></p> <p><span><strong><br /></strong></span></p> <p><span><strong>Why work with us?</strong></span></p> <p><span>Because you have worked hard to master your craft but you want to do more and make your mark in this world. You are relentless in the pursuit of excellence and you are ready to code to cure.</span></p> <p><span><br /></span></p> <p><a href=\"https://www.youtube.com/watch?v=B5iEqEBM8Tw\" target=\"_blank\"><span>CEO Presentation </span></a></p> <p><span><strong><br /></strong></span></p> <p><span><strong>Bina Culture – <span>What’s important to us, and ideally to you:</span></strong></span></p> <ul> <li><span> We&#39;re solving some of the most important problems in the world with high performance computing and we have a passion for revolutionizing healthcare.</span></li> <li><span> We are driven every day by our collective desire to make the world a better place by tackling the most difficult big data problems.</span></li> <li><span> We are all leaders in our own ways, regardless of position or title. We take initiatives and own our work, and solve problems together.</span></li> <li><span> We work towards making our users successful and empowered. Our goal is to support, train and provide for them.</span></li> <li><span> We are a team. We care for each other and help each other. We  nurture, mentor and learn from each other. We appreciate the diverse talent and backgrounds that different individuals bring to our team.</span></li> <li><span> Like what you see? <a href=\"http://www.bina.com/team\" target=\"_blank\"><span>Learn more about the team</span></a><span> behind Bina Technologies.</span></span></li> </ul> <p><span><br /></span></p> <p><span>Bina is an Equal Employment Opportunity (EEO) employer and does not discriminate on the basis of race, color, national origin, religion, gender, age, veteran status, political affiliation, sexual orientation, marital status or disability (in compliance with the Americans with Disabilities Act) with respect to employment opportunities.</span></p> <p><span><strong><br /></strong></span></p> <p><span><strong>Outside Recruiters:</strong></span><span><span>Please do not contact Bina Technologies employees with unsolicited resumes. Any resume sent by an outside agency without an explicit signed Bina generated agency agreement in place will be considered unsolicited and will not be eligible for payment.</span> </span></p> <br/><br/><a href=\"http://www.Click2Apply.net/hhtdvw3v7b\">Apply Here</a><br/><br/></p>\n\n<p><img class=\"img\" src=\"https://rs.careerliaison.com/pixel/hhtdvw3v7b\"><img class=\"img\" src=\"https://analytics.click2apply.net/vdl6B6yCLA57AtBdas5fb\"><style>img.img { width: 0px !important;}</style></p>\n",
"how_to_apply": "<p>Apply Online</p>\n",
"company": "Bina Technologies Inc.",
"company_url": null,
"company_logo": null,
"url": "http://jobs.github.com/positions/2bda413e-313a-11e5-9fa0-cf372b1e2c98"
},
{
"id": "a7af1a92-3139-11e5-9d59-b44d4934ae5c",
"created_at": "Thu Jul 23 12:53:11 UTC 2015",
"title": "Lead back-end software engineer",
"location": "Redwood City, California",
"type": "Full Time",
"description": "<p><p><strong>Lead Backend Engineer</strong></p> <p><a href=\"https://hire.jobvite.com/j?cj=ogiy0fwQ&s=td\"><strong>Apply Now!</strong></a></p> <p><strong><br /></strong></p> <p>As a Lead Software Engineer you will wear several hats and be recognized as much for your leadership skills, team building as for your expertise in web technologies, distributed systems, and high-performance cloud computing platforms. Your top three priorities will be Infrastructure/Platform, Applications, and Leadership.</p> <br /> <p><strong>How you will spend your time:</strong></p> <ul> <li>Solving difficult problems related to processing large amounts of data.</li> <li>Building the distributed infrastructure for Bina’s public and private cloud platform to enable aggregation, storage and computation of petabytes of genomic data.</li> <li>Working with bioinformaticians and biologists to create the most efficient and production-grade applications to build genomic analysis tools on top of the Bina platform.</li> <li>Participating in product design and development, customer training, support, and sales activities as needed.</li> <li>Synthesizing priorities - Work collaboratively with stakeholders to internalize business needs and drive priorities for the team.</li> <li>Providing guidance during code reviews, with a balance of between idealistic and pragmatic feedback.</li> <li>Doing the dance of recruiting, building a team and managing team technical tasks.<strong> <br /></strong></li> </ul> <p><strong><br /></strong></p> <p><strong>Experience and skills you will need:</strong></p> <ul> <li>You are a doer and a leader who can shift from one role to another as your team grows.</li> <li>8+ years of hands on experience in large scale production coding, agile, architecture, and people leadership.</li> <li>Java is your language of choice; for developing reliable, scalable, secure, and high-performing services.</li> <li>You are well versed in Java-based frameworks and run-time environments, skilled in all things integration and some of your best friends are technologies such as REST, SOAP, Thrift, etc..</li> <li>You show relentless dedication to writing testable code.</li> <li>You communicate clearly, and frequently. You believe in pride of ownership. You obsess over the details, without losing the big picture. Your solutions are as elegant even when the problem is intricate.</li> <li>Passion for the opportunity to build superb software products for genome and cancer analysis.</li> <li>B.S., M.S., or Ph.D.  in computer science or equivalent field.<em> <br /></em></li> </ul> <p><em><br /></em></p> <p><em>Do you have any side projects, open source contributions, one cool piece of code, or a link to something you’ve built, or a hack that you’re proud of? Send with your resume, as we would love to talk about it.</em></p> <p><span><strong><br /></strong></span></p> <p><span><strong>About Us</strong></span></p> <p><span>We code to cure! At Bina, we have a passion for improving lives by accelerating the science of personalized medicine. This is where Life Science meets Computer Science.</span></p> <p><span><br /></span></p> <p><span>The science of interpreting the human genome is an exciting work in progress. Next-generation sequencing and genomic technologies are providing us with unprecedented visibility into the origins of health and disease. However, the main challenge is enabling the analysis and management of massive datasets being produced by scientists and researchers around the world.</span></p> <p><span><br /></span></p> <p><span>At Bina, we are dedicated to tackling this challenge every day. We know the ability to analyze and manage these datasets will revolutionize how we diagnose disease, develop drugs, and treat patients, especially in complex cases such as cancer.</span></p> <p><span><br /></span></p> <p><span>Watch our code2cure meetup presentation and slide deck </span><a href=\"http://www.slideshare.net/amirhkiani/code2cure\" target=\"_blank\"><strong><span>her</span>e</strong></a></p> <br /> <p><span>With a strong interdisciplinary knowledge in science and technology, we are elevating the speed and quality  of genomic analysis, bringing us one step closer to solutions that will change and save lives.</span></p> <p><span><br /></span></p> <p><span>Headquartered in Redwood City, California, Bina Technologies was recently acquired by Hoffmann-La Roche and now is part of Roche Sequencing.</span></p> <p><span><br /></span></p> <p><span><strong>Why work with us?</strong></span></p> <p><span>Because you have worked hard to master your craft but you want to do more and make your mark in this world. You are relentless in the pursuit of excellence and you are ready to code to cure.</span></p> <p><span><br /></span></p> <p><a href=\"https://www.youtube.com/watch?v=B5iEqEBM8Tw\" target=\"_blank\"><span>CEO Presentation </span></a></p> <br /> <p><span><strong>Bina Culture – <span>What’s important to us, and ideally to you:</span></strong></span></p> <ul> <li><span> We&#39;re solving some of the most important problems in the world with high performance computing and we have a passion for revolutionizing healthcare.</span></li> <li><span> We are driven every day by our collective desire to make the world a better place by tackling the most difficult big data problems.</span></li> <li><span> We are all leaders in our own ways, regardless of position or title. We take initiatives and own our work, and solve problems together.</span></li> <li><span> We work towards making our users successful and empowered. Our goal is to support, train and provide for them.</span></li> <li><span> We are a team. We care for each other and help each other. We  nurture, mentor and learn from each other. We appreciate the diverse talent and backgrounds that different individuals bring to our team.</span></li> <li><span> Like what you see? <a href=\"http://www.bina.com/team\" target=\"_blank\"><span>Learn more about the team</span></a><span> behind Bina Technologies.</span></span></li> </ul> <p><span><br /></span></p> <p><span>Bina is an Equal Employment Opportunity (EEO) employer and does not discriminate on the basis of race, color, national origin, religion, gender, age, veteran status, political affiliation, sexual orientation, marital status or disability (in compliance with the Americans with Disabilities Act) with respect to employment opportunities.</span></p> <p><span><strong><br /></strong></span></p> <p><span><strong>Outside Recruiters:</strong></span><span><span>Please do not contact Bina Technologies employees with unsolicited resumes. Any resume sent by an outside agency without an explicit signed Bina generated agency agreement in place will be considered unsolicited and will not be eligible for payment.</span> </span></p> <br /> <br/><br/><a href=\"http://www.Click2Apply.net/jj6bmf5thx\">Apply Here</a><br/><br/><img class=\"img\" src=\"https://rs.careerliaison.com/pixel/jj6bmf5thx\"><img class=\"img\" src=\"https://analytics.click2apply.net/v8pyW77F68KgAiGzZI4fW\"><style>img.img { width: 0px !important;}</style></p>\n",
"how_to_apply": "<p>Apply Online</p>\n",
"company": "Bina Technologies Inc.",
"company_url": null,
"company_logo": null,
"url": "http://jobs.github.com/positions/a7af1a92-3139-11e5-9d59-b44d4934ae5c"
},
{
"id": "b3e0376a-30f8-11e5-9fe1-081b1c6dc334",
"created_at": "Thu Jul 23 05:08:04 UTC 2015",
"title": "Senior Software Engineer – Rails/Front End",
"location": "Sunnyvale",
"type": "Full Time",
"description": "<p>WORK REMOTE FROM YOUR LOCATION or join one of our growing developer teams in Sunnyvale, San Francisco, Kirkland WA or Scottsdale AZ!</p>\n\n<p>GoDaddy is a publicly held (NYSE:GDDY) technology company. Our vision is to radically shift the global economy toward small business by empowering people to easily start, confidently grown and successfully run their own ventures.  While our roots begin in the Internet domain registrar and web hosting, today our 4 thousand employees have built a robust platform of web-based tools and products to help more than 12 million customers around the world as well as deliver 24/7/365 customer care.\nWe&#39;re looking for a passionate software engineer that loves working as a full stack web developer, has strong analytical skills and cutting edge coding skills. You should live and breathe modern web stacks. The opportunity to work on a modern codebase with Coffeescript, SASS, an HTML5 sitting on top of a Rails API backend delivered responsively to all sorts of devices should sound like your dream scenario.\nAs a Senior Software Engineer for Web Pros at GoDaddy, you will join a cross functional team of world-class engineers, using the latest and greatest development technologies and agile practices, to help connect small business owners to technical freelancers.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Build amazing product experiences through iterative, custom-driven development.</li>\n<li>Collaborate deeply with a cross functional team of Engineers, UX, Product and Operations.</li>\n<li>Leverage practices such as Test Driven Development and Continuous Integration to ship code early and often  (Think: Daily deploys)</li>\n<li>Apply Lean Startup/Agile approaches to software development</li>\n<li>Work in an open space environment (no cube walls, no offices)</li>\n</ul>\n\n<p>Requirements:</p>\n\n<ul>\n<li>5+ years professional development experience</li>\n<li>2+ years of experience on the Rails stack (Rails API, Javascript front-end)</li>\n<li>Motivated by having an IMPACT on Customers and the Company</li>\n<li>Have launched a complex project and iterated on it</li>\n<li>Team Player, strong in Communications and Collaboration skills</li>\n<li>Customer focus and Bias for Action</li>\n<li>Strong communication skill</li>\n</ul>\n\n<p>GoDaddy is a proud equal opportunity employer!</p>\n",
"how_to_apply": "<p><a href=\"https://hire.jobvite.com/j?aj=odcU0fw3&amp;s=GitHub_Jobs\">https://hire.jobvite.com/j?aj=odcU0fw3&amp;s=GitHub_Jobs</a></p>\n",
"company": "GoDaddy",
"company_url": "http://www.godaddy.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/91a2a962-30f8-11e5-8a41-22e5a1bb7e13.png",
"url": "http://jobs.github.com/positions/b3e0376a-30f8-11e5-9fe1-081b1c6dc334"
},
{
"id": "b59f6c7e-30d5-11e5-8bc5-8605f8dba5e2",
"created_at": "Thu Jul 23 00:58:38 UTC 2015",
"title": "Senior Software Engineer—Site Reliability",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>This role combines expertise in software development, networking, and systems administration to streamline the creation and improvement of Affirm’s financial platform and system infrastructure. As a Senior Software Engineer focusing on Site Reliability, you will be in the center of the action. You will build and maintain systems to ensure the scalability, reliability and performance of our distributed banking platform, and work across the company to ensure the Affirm infrastructure is functioning at a high level to support the engineering team and all aspects of the company. You will play a key role in our team’s mission to re-imagine and re-build core parts of the financial infrastructure from the ground up.</p>\n\n<p>This is the first role of its kind at Affirm and will be an exciting opportunity to have a major impact on the engineering team and the success of the company.</p>\n\n<p><strong>What You’ll Do</strong></p>\n\n<ul>\n<li>Address complex software and systems issues ranging from distributed change propagation on live serving systems to designing and deploying complex multi-stage data pipelines</li>\n<li>Develop your own custom tools to create optimal infrastructure</li>\n<li>Automate as much of your work as possible, using a language of your choice</li>\n<li>Document the architecture and methods for operating services and systems</li>\n<li>Engage in software and system performance analysis and tuning, service-capacity-planning and demand forecasting</li>\n<li>Participate in a 24x7 on-call rotation</li>\n</ul>\n\n<p><strong>What We Look For</strong></p>\n\n<ul>\n<li>Passion and drive to change consumer banking for the better</li>\n<li>Hands-on software development experience in a strongly-typed language</li>\n<li>Experience with system monitoring and alerting for availability and performance</li>\n<li>Mastery of Unix/Linux systems</li>\n<li>Solid understanding of network protocols (TCP/IP, UDP, ICMP, etc), MAC addresses, IP packets, DNS, OSI layers, and load balancing</li>\n<li>Experience with configuration management software like Salt, Chef, Puppet, etc.</li>\n</ul>\n\n<p><strong>About Affirm</strong></p>\n\n<p>At Affirm we are using technology to re-imagine and re-build core parts of financial infrastructure to enable cheaper, friendlier, and more transparent financial products and services that improve lives. </p>\n\n<p>We believe the financial industry is fundamentally broken. Not only is the core infrastructure built with technology from the 1970s, but there are a dwindling number of people who say “I trust my bank to look out for me.” It doesn’t have to be this way, and it’s our mission to fix this problem.</p>\n\n<p>We are based in San Francisco; founded by Max Levchin (founding CTO PayPal), Jeff Kaditz (CDO DeNA/ngmoco), and Nathan Gettings (founding CTO of Palantir); and building a team of exceptionally talented people to join us on our mission.</p>\n",
"how_to_apply": "<p>Please follow the following link to apply on our website: <a href=\"https://jobs.lever.co/affirm/c29a345a-fbc0-4f11-9c00-a829f9a071ce/apply\">Senior Software Engineer—Site Reliability Application</a></p>\n",
"company": "Affirm",
"company_url": "http://www.affirm.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/92e69734-30d5-11e5-8c5b-c3d7fa45191b.png",
"url": "http://jobs.github.com/positions/b59f6c7e-30d5-11e5-8bc5-8605f8dba5e2"
},
{
"id": "166157a2-2fa5-11e5-80af-205576c657d5",
"created_at": "Tue Jul 21 12:37:18 UTC 2015",
"title": "Product Marketing Manager Analytics",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p><p><strong>New Relic  <br /></strong><strong>Product Marketing Manager – Analytics<br /></strong><strong>San Francisco, CA or Portland, OR</strong>  </p> <br /> <p>Want to join a fast-paced, rapidly growing SaaS company that’s disrupting a multi-billion dollar industry? That’s what we’re doing here each day at New Relic. We are the leading software analytics company, delivering out of this world experiences to our customers through our SaaS-delivered Software Analytics Platform.</p> <br /> <p>We thrive on providing products that help software developers, IT Operations, DevOps teams, and application owners drive better software application performance, customer experience and business outcomes.</p> <p>We are looking for a world class Product Marketing Manager to join our Product Marketing team, leading outbound product marketing activities specifically for our New Relic Insights product. New Relic Insights is pioneering a new category called Software Analytics, enabling companies to use application metrics to better understand how application performance and customer experience drive business success. In this role you will own product &amp; competitive positioning, sales enablement, market &amp; competitive analysis, product launches, customer development, and more for Insights.  </p> <br /> <p>The ideal candidate will have significant experience as a product marketing, product management, sales engineering, customer support and/or training professional at business intelligence and/or big data software companies targeting business and technical buyers.  </p> <br /> <p><strong>Key Responsibilities</strong></p> <br /> <ul> <li>Develop positioning and messaging that resonates with Insight’s audience: product managers, app owners, developers and IT Operations</li> <li>Enable the sales force by developing collateral and providing training</li> <li>Develop marketing collateral: datasheets, eBooks, whitepapers, presentations, etc.</li> <li>Perform market and competitive research and analysis</li> <li>Plan and manage product launch activities</li> <li>Work with product management and engineering to define product roadmap</li> <li>Present at tradeshows and conferences</li> </ul> <div> </div> <p><strong>Requirements</strong></p> <p><strong><br /></strong></p> <ul> <li>6+ years working in product marketing, product management and/or sales engineering at business intelligence and/or big data software companies</li> <li>Experience positioning technical products to both business and technical buyers</li> <li>Demonstrated ability to distill simple positioning from complex products</li> <li>Technical depth and curiosity balanced with a strong business acumen</li> <li>Familiarity with the business intelligence and big data market landscape, including commonly used BI products and technologies, SQL, and Hadoop</li> <li>Experience working effectively across marketing and sales organizations</li> <li>Excellent oral and written communication skills</li> </ul> <div> </div> <p><strong>A little about us:</strong></p> <p><strong><br /></strong></p> <p>New Relic is a software analytics company that, on behalf of our customers, makes sense of billions of metrics about millions of applications, all in real time. Our comprehensive SaaS-based solution for web and mobile applications consolidates the performance monitoring data into a single, powerful interface. Our customers use New Relic every day to optimize millions of applications.  </p> <br /> <p>New Relic is a San Francisco Best Places to Work award winner, an Oregon “Top Workplace” award winner, named a leader in the Gartner’s 2013 “Magic Quadrant” for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) – the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high quality teammates, a standard-setting product, and a company on the move.</p> <br /> <p>Our offices are in the tech-rich urban centers of San Francisco &amp; Portland, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up. We can help with relocation and are open to H1-B transfers.</p> <br /> <p>New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender, religion, national origin, ancestry, citizenship, individuals with disabilities, age, sexual orientation, protected veterans, or any other characteristic protected by law. Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic.  We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance.</p> <br /> <p>To get started, click on the link below. To fast track your application, let us know in your cover letter why this job, product, and/or company is of particular interest to you. We look forward to talking!</p> <p><br /><br /></p> <p>#LI-CV1</p> <br/><br/><a href=\"http://www.Click2Apply.net/5h42ngs3sf\">Apply Here</a><br/><br/></p>\n\n<p><img class=\"img\" src=\"https://rs.careerliaison.com/pixel/5h42ngs3sf\"><img class=\"img\" src=\"https://analytics.click2apply.net/vWgLMdAFZjDwxF8AnSMfR\"><style>img.img { width: 0px !important;}</style></p>\n",
"how_to_apply": "<p>Apply Online</p>\n",
"company": "New Relic",
"company_url": null,
"company_logo": "http://github-jobs.s3.amazonaws.com/555c5730-3712-11e5-8fc4-e2fd8b460e8a.png",
"url": "http://jobs.github.com/positions/166157a2-2fa5-11e5-80af-205576c657d5"
},
{
"id": "2f12aecc-2ece-11e5-91f3-6ddd82a144b2",
"created_at": "Mon Jul 20 10:58:46 UTC 2015",
"title": "Senior DevOps Engineer",
"location": "Menlo Park, CA",
"type": "Full Time",
"description": "<p>Company Description</p>\n\n<p>Next Issue is the only company that provides unlimited digital access to the most loved magazines for one low monthly price. And now Next Issue is on the cusp of disrupting the way people read, discover and explore these taste making editorial brands.</p>\n\n<p>In a digital world becoming increasingly saturated with content of varying quality, forcing the consumer to curate their own information, Next Issue provides a refreshing singular location where readers can escape and inspire their interests with well written, beautifully designed stories. At its core, Next Issue speaks to an essential human truth, that we are all hyphenated beings with a range of interests and passions. Our goal is to build the most engaging and compelling premium content platform that simplifies how people discover inspiring content they trust and value for all of their interests.</p>\n\n<p>Next Issue recently raised $50 million in an investment round led by KKR; and is supported by the world’s leading publishing houses including Time Inc., Hearst, Conde Nast, Meredith, News Corp and Rogers Communication.</p>\n\n<p>Job Description</p>\n\n<p>Next Issue Media has an exciting opportunity in our Technical Operations team for an self motivated, energetic and tenacious Senior DevOps Engineer who is enthusiastic about systems reliability, automation and scaling. We are in the process of moving to the cloud from a colocation based operation and this position will play a key role in supporting this project. Your results oriented aggressiveness in meeting commitments will help in managing our rapidly growing LAMP servers on private and public cloud infrastructure. </p>\n\n<p>Responsibilities:</p>\n\n<p>Build and manage hybrid cloud server networks and infrastructure in development, QA and production environments.\nProvision managed services and associated products to customers.\nWork with a team to automate management and orchestration tasks, streamline processes and perform standard administration functions as needed.\nMonitor system performance, make recommendations to improve and implement system wide changes to enhance overall system proficiency.\nMonitor network availability and performance.\nAssist in formulating security mechanisms to prevent, detect &amp; respond to internal and external security threats.\nHandle production support issues as they arise. Participate in a 24/7 on-call rotation.</p>\n\n<p>Qualifications</p>\n\n<p>6+ years administering and managing Linux systems in a production environment.\nExperience configuring, deploying and managing a clustered application stack in Amazon Web Services (AWS) or similar public cloud environments.\nSolid understanding of Linux distributions including CentOS, Ubuntu or equivalent.\nExperience with HTTP and web application servers such as Apache, Tomcat &amp; Jetty.\nStrong scripting skills with a variety of languages including Python and bash.\nPostgreSQL or MySQL database experience including basic administration tasks.\nExperience with configuration management and deployment tools (Ansible, Docker, Chef, etc.).\nSolid understanding of various protocols such as DNS, NIS, LDAP and NFS.\nFamiliar with revision control systems (SVN, Git); network management tools (Zabbix, Nagios, Cacti, Zenoss); communication tools (wikis, issue trackers).\nStrong, creative problem solving and analytical skills. Ability to work independently and as part of a team with excellent written and oral communication skills. Handle pressure-filled situations in a professional, responsive manner.\nBachelor’s Degree in Computer Science or equivalent discipline.</p>\n\n<p>Nice to have:</p>\n\n<p>Experience with any or all of managed switch (from Cisco), firewall (from Juniper) and load balancer (from F5) infrastructure.\nProduction use of centralized log analysis tools (Splunk, Kibana, syslog-ng).\nSetup and operation of NoSQL databases (Cassandra, MongoDB &amp; DynamoDB) and Hadoop clusters (Apache, Cloudera, MapR, etc.)\nExperience in private clouds using virtualization technologies such as KVM and Xen.</p>\n\n<p>Additional Information</p>\n\n<p>Competitive Salary and opportunity for career growth\nFull medical, dental, vision, disability, and life insurance\n401K + company match\nOffices in Menlo Park (close to Menlo Park Caltrain station) and Financial District\nFitness center, fitness class, ping-pong, pinball, and team bonding events\nHealthy snacks, drinks, and weekly lunches\nA fun, flexible, and friendly startup</p>\n\n<p>If you love magazines and want to be a part of a company that is revolutionizing the digital space, please apply!</p>\n",
"how_to_apply": "<p>Please apply online at: <a href=\"https://www.smartrecruiters.com/NextIssueMedia/84159358-senior-devops-engineer\">https://www.smartrecruiters.com/NextIssueMedia/84159358-senior-devops-engineer</a></p>\n",
"company": "Next Issue Media",
"company_url": "https://www.nextissue.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/297ba8c4-2ece-11e5-8d07-2420b7b9de49.jpg",
"url": "http://jobs.github.com/positions/2f12aecc-2ece-11e5-91f3-6ddd82a144b2"
},
{
"id": "ef5b9194-2e7e-11e5-8f56-685fa0eda16c",
"created_at": "Mon Jul 20 01:32:01 UTC 2015",
"title": "Dev Ops Engineer",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>ABOUT THE ROLE</p>\n\n<p>We are looking for a strong dev ops engineer to build our operations team. In this role, you will architect, implement, and administer our AWS-based infrastructure. In addition, you will lead development of tools that will help us monitor our infrastructure and proactively respond to issues before they arise.</p>\n\n<p>ABOUT YOU</p>\n\n<p>-2 years of experience as either a sysadmin or dev ops engineer</p>\n\n<p>-1+ year managing a non-trivial system architecture in AWS</p>\n\n<p>-You have built reusable system configuration files, and are familiar with modern tools to do so (Puppet, Chef, Ansible, Linux, Docker)</p>\n\n<p>-Focus on tool building to manage automation, monitoring, and alerts</p>\n\n<p>-Good instincts around building resilient and self-healing distributed systems</p>\n\n<p>-Preferable: expertise or a strong interest in security best practices and defense mechanisms</p>\n",
"how_to_apply": "<p>Apply here: <a href=\"https://jobs.lever.co/expedite/1ba83d36-713c-4acf-bcb2-3fe6accb2987\">https://jobs.lever.co/expedite/1ba83d36-713c-4acf-bcb2-3fe6accb2987</a></p>\n",
"company": "Expedite Financial",
"company_url": "http://expeditefinancial.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/e7d28158-2e7e-11e5-983e-2b26438fba84.jpg",
"url": "http://jobs.github.com/positions/ef5b9194-2e7e-11e5-8f56-685fa0eda16c"
},
{
"id": "54344ac6-2e7e-11e5-9ca3-20cea50dee3d",
"created_at": "Mon Jul 20 01:28:05 UTC 2015",
"title": "Front End Engineer",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>ABOUT THE ROLE</p>\n\n<p>Our front end engineers build both consumer-facing and internal applications that transform a complicated and data-intensive domain into simple, intuitive, and delightful experiences. Our front end stack is composed of API-driven javascript apps built in React, AngularJS, and sass.  In this role you will collaborate with designers, product leads, and platform engineers to build beautiful and intuitive applications, comprised of reusable components with good performance and usability across browsers and mobile devices.</p>\n\n<p>ABOUT YOU</p>\n\n<p>-You have deep knowledge of javascript, HTML, CSS, and browser behavior</p>\n\n<p>-You have experience with modern javascript frameworks (React or AngularJS preferred)</p>\n\n<p>-You have an interest in usability and design aesthetics</p>\n\n<p>-You are familiar with modern front-end tool chains – build tools, unit tests, linters, debuggers</p>\n\n<p>-You naturally build for structure, reusability, and sharing – you make other developers happier and more productive</p>\n",
"how_to_apply": "<p>Apply here: <a href=\"https://jobs.lever.co/expedite/8f3ae4ff-1562-49a0-9edb-b6b7aa215e7d\">https://jobs.lever.co/expedite/8f3ae4ff-1562-49a0-9edb-b6b7aa215e7d</a></p>\n",
"company": "Expedite Financial",
"company_url": "http://expeditefinancial.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/2d2cec58-2e7e-11e5-9528-24072fdb7b0a.jpg",
"url": "http://jobs.github.com/positions/54344ac6-2e7e-11e5-9ca3-20cea50dee3d"
},
{
"id": "12333646-1547-11e5-9bea-95cd021bfc8b",
"created_at": "Sat Jul 18 14:30:14 UTC 2015",
"title": "Full Stack Javascript Engineer",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>At CreativeLive, we are relentless in our pursuit of wonder. We believe the best work is created with equal parts imagination, discipline, and hustle. We believe play is a daily practice, and that creativity is the new literacy.</p>\n\n<p>Join our <strong>dynamic team of tinkerers hard at work building the future of education</strong>. From our offices in Seattle and San Francisco, we connect students from all walks of life with top-notch learning from industry leaders. We make it possible for people everywhere to learn what they want and do what they love.</p>\n\n<p><strong>Make real things. Stay curious. Have fun.</strong></p>\n\n<p>CreativeLive is looking for <strong>talented engineers</strong> to join our growing technical team in our San Francisco office. You will be forging a new frontier in online learning applications, leveraging and contributing to open source technology.</p>\n\n<p>Our platform is built on <strong>Node and Angular</strong>, so you will ideally have solid experience coding in Javascript, and be excited by being empowered to contribute and learn at any level of the stack, from defining clean server APIs to creating beautiful front-end experiences.</p>\n\n<p>Along with your fellow engineers, you&#39;ll be working with design and product to continuously improve the CreativeLive site and internal tools by:</p>\n\n<ul>\n<li>iterating on prototypes</li>\n<li>architecting modules and applications</li>\n<li>refactoring existing parts of the site</li>\n<li>extending our content management system</li>\n<li>implementing data visualization dashboards</li>\n<li>interfacing with (and creating) web services </li>\n<li>improving the scalability and fault tolerance of our distributed systems</li>\n<li>actively contributing to refining our Agile development processes</li>\n</ul>\n\n<p><strong>What we&#39;re looking for:</strong></p>\n\n<ul>\n<li>2+ years professional experience as a software engineer</li>\n<li>Mastery of basic Computer Science principles</li>\n<li>Strong programming skills in a variety of languages </li>\n<li>Excellent HTML/CSS skills</li>\n<li>A passion for clean and elegant code</li>\n<li>Understanding of web services</li>\n<li>A good understanding of how to create responsive websites</li>\n<li>Experience with both relational and non-relational databases, such as MongoDb, Redis, and MySQL</li>\n</ul>\n\n<p><strong>Preferred:</strong></p>\n\n<ul>\n<li>A 4-year accredited technical degree, or equivalent professional experience (not just a coding bootcamp, please)</li>\n<li>Experience writing complex applications in Javascript</li>\n<li>Familiarity with Node.js and the common frameworks and npm modules</li>\n<li>An active Github account, showcasing your own projects</li>\n</ul>\n",
"how_to_apply": "<p>Please apply at <a href=\"http://www.creativelive.com/jobs\">www.creativelive.com/jobs</a></p>\n",
"company": "CreativeLive, Inc.",
"company_url": "http://www.creativelive.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/02636f60-1547-11e5-869a-7b4060c39ce1.jpg",
"url": "http://jobs.github.com/positions/12333646-1547-11e5-9bea-95cd021bfc8b"
},
{
"id": "c34667c6-2cd7-11e5-9574-d0a005a22e3f",
"created_at": "Fri Jul 17 23:02:16 UTC 2015",
"title": "DevOp Engineer",
"location": "Mountain View, CA",
"type": "Full Time",
"description": "<p>If you have implemented and supported a cutting edge public cloud environment, have excellent analytical skills, and a passion for scalable and stable engineering environments, we want to talk with you!  Working closely with our engineering team, you will implement and scale our predominantly Ruby and Java-based architecture. We love the fact that you are a little obsessive about maintaining high availability for all of the services we manage, while also implementing the infrastructure solutions that our teams need to continue building our product.\n<br>\n<br>At Treasure Data, you will have opportunities to combine your technical ability, strategic thinking and detail-oriented execution in a fast-paced, dynamic, entrepreneurial environment. Your work will contribute to the design and management of serious infrastructure that is servicing large amounts of data and traffic, while working with a truly world-class engineering team, always employing state-of-the-art tools and techniques.\n<br>\n<br><b>THINGS YOU WILL DO:</b>\n<br><ul>Manage PostgreSQL/MySQL databases and traditional k-v stores and clusters</ul></p>\n\n<ul>Manage 100+ cloud servers using automation tools</ul>\n\n<ul>Investigate of system errors and problems</ul>\n\n<ul>Perform bottleneck analysis of the system for scaling</ul>\n\n<ul>Setup monitoring systems and application metrics as well as supervise them for</ul> prediction/detection of failures.</ul>\n\n<p><br><b>YOUR SKILLS INCLUDE:</b>\n<br><ul>3+ years of experience installing, maintaining, tuning, and scaling PostgreSQL/MySQL (or other relational database) clusters</ul></p>\n\n<ul>5 years of experience of managing servers with using Chef, Puppet, Ansible, etc.</ul>\n\n<ul>5 years of experience of Ruby/Python scripting for automation of continuous integration and continuous deployment systems, cluster setup and teardown, and computing and storage resource autoscaling</ul>\n\n<ul>Deep knowledge on cloud APIs for automation of server management.</ul>\n\n<p><br><b>WE WOULD BE THRILLED IF YOU HAVE:</b>\nExperience with search engines (ElasticSearch, Solr, ...)\nExperience with key-value stores and caching (Cassandra, Redis, Memcached, ...)\nFamiliarity with Kafka and other messaging systems (RabbitMQ, MQTT, AMPQ, …)\n<br>\n<br><b>Working at Treasure Data</b>\n<br>You can expect a work environment where the team is collaborative and open to your ideas, while we keep our collective eye on supporting our customers’ needs.  Our team is committed to technical innovation in our product and in the world through customer collaboration, open-source projects, and by continuing to make our product an integral part of our customers’ growth and success.  </p>\n\n<p>We’re committed to our employees having a big stake in the company as we grow it towards our shared goals.  We’re uncompromising in hiring top talent for every function, offering competitive salaries, benefits and stock options, as well as a casual, comfortable work environment, with a free lunch, every day...all steps away from Caltrain!</p>\n\n<p><br><b>About Us</b>\nTreasure Data is a Cloud infrastructure for analytics at scale. Our product is not just liked, but loved by our customers, for its ease of use and reliability.   We’ve often heard that “Treasure Data works as promised!”  In the fiercely competitive big data analytics space, this is a huge differentiator.  Treasure Data is backed by top investors like Sierra Ventures and Scale Venture Partners.  In addition to our Silicon Valley headquarters, we have offices in Tokyo and Seoul. </p>\n\n<p>Agencies and recruiters, we cannot consider your candidate(s) without a contract in place.  Any resumes received without having an active agreement will be considered gratis referrals to us.  Thank you for your understanding and cooperation!</p>\n",
"how_to_apply": "<p>Please apply via <a href=\"https://jobs.lever.co/treasure-data/227f1885-7d53-4abc-93ba-5e847d46de59\">https://jobs.lever.co/treasure-data/227f1885-7d53-4abc-93ba-5e847d46de59</a></p>\n\n<p>If you have issues with this link, please send your resume to <a href=\"mailto:petra@treasuredata.com\">petra@treasuredata.com</a></p>\n",
"company": "Treasure Data",
"company_url": "http://www.treasuredata.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/855635f0-2cd6-11e5-965c-1ea5cb59f126.png",
"url": "http://jobs.github.com/positions/c34667c6-2cd7-11e5-9574-d0a005a22e3f"
},
{
"id": "c333cbc0-2ca5-11e5-8b23-3ca606ef21c8",
"created_at": "Fri Jul 17 17:03:36 UTC 2015",
"title": "Sr. Data Engineer",
"location": "San Francisco, CA, US",
"type": "Full Time",
"description": "<p><p>As a Data Software Engineer, you will focus on developing the tools and infrastructure to capture, manage and manipulate large data sets of reader behavior. Your goal will be to support and work with Sr Data Scientist to extract meaning from the data and advise our editorial and development teams on the findings. You look to tell a story based on your findings to assist in developing the product road map to customize our content to better suit our reader. This position will bring analytical rigor and statistical methods to the challenges of measuring and understanding the behavior of the 40 million+ women that shop and consume content at POPSUGAR every month.</p><p> </p><p><strong>As a Data Software Engineer, you will:</strong></p><p>• Implement and deploy systems for measuring and analyzing the performance of the POPSUGAR media site and targeted email products.</p><p>• Develop new data storage and data analysis methods for optimizing content performance, revenue, and adoption.</p><p>• Implement new mechanisms for modeling and predicting reader behavior.</p><p>• Lead investigations streams of content usage and A/B testing. Advise product team on new features and modules based on findings.</p><p>• Design and implement experiments and models to answer targeted questions.</p><p> </p><p><strong>Requirements:</strong></p><p> • At least 4 years of hands-on experience working with large data sets. </p><p> • Hands on deployment experience with Hadoop/Spark, Scala, MySQL, Redshift and Amazon AWS or other cloud base systems.</p><p> • Minimum of a BS in a quantitative discipline such as Statistics, Engineering, Computer Science, Applied Mathematics, etc.</p><p> • Demonstrated proficiency in SQL, SAS, Matlab, or R.</p><p> • Comfortable writing code in python, ruby, perl, or equivalent scripting language.</p><p> • Ability to understand business problems, draw conclusions from data and recommend actions on how best to solve these problems.</p><p> • Demonstrated self-direction.</p> <img src=\"https://www.applytracking.com/track.aspx/6Qs0f\"/></p>\n",
"how_to_apply": "<p><a href=\"https://www.applytracking.com/track.aspx/6Qs0p\">https://www.applytracking.com/track.aspx/6Qs0p</a></p>\n",
"company": "POPSUGAR",
"company_url": null,
"company_logo": null,
"url": "http://jobs.github.com/positions/c333cbc0-2ca5-11e5-8b23-3ca606ef21c8"
},
{
"id": "e7d2d1a8-2bf4-11e5-83d1-ccd162021c71",
"created_at": "Thu Jul 16 19:57:36 UTC 2015",
"title": "Senior Web Application Engineer",
"location": "San Francisco, CA, US",
"type": "Full Time",
"description": "<p><p style=\"text-align: center;\"><a href=\"https://www.udemy.com/blog/udemy-mission-culture-philosophies-team/\"><u>Let’s Go.</u></a></p><p style=\"text-align: center;\">Let’s go inspire 100 million people learn anything they can imagine. Let’s go inspire 100,000 instructors to share their knowledge with the world. Let’s go help 10,000 businesses to change the way their employees learn.</p><p style=\"text-align: center;\">Learn. Empathize. Take Ownership. ‘nnovate. Show Passion.</p><p style=\"text-align: center;\">Get Stuff Done. Open Up.</p><p><strong>ABOUT UDEMY</strong></p><p>Udemy is an online marketplace where anyone in the world can take or teach a course on virtually anything, whenever and wherever they want. Our mission is to empower on-demand learning that’s accessible to all by offering instruction in a way that’s affordable, simple, and flexible, so individuals can fulfill their limitless potential on their own terms.</p><p>Our more than 7 million students can gain skills to launch a new career, advance in their current field, or try something new for their own personal development by choosing from more than 30,000 courses in 80+ languages. Our instructors are passionate experts who want to share their knowledge with a broad audience. Udemy also works with companies to help them develop more effective and engaging skills-based training for their employees.</p><p><br>Founded in 2010, Udemy is privately owned and funded by Stripes Group, Norwest Venture Partners, Insight Venture Partners, Lightbank, MHS Capital, Learn Capital, and 500 Startups, among others. Udemy is headquartered in San Francisco’s SOMA neighborhood and has offices in Dublin, Ireland, and Ankara, Turkey. Compensation includes full time salary, equity compensation plan, and competitive benefits (including healthcare, commuter benefits and an unlimited vacation policy).</p><p><strong>JOB DESCRIPTION:</strong></p><p>This is a full-stack development role with emphasis on frontend architecture for Udemy’s core teaching and learning platform.</p><p> </p><ul>   <li>    <p>Design and organize frontend JavaScript for a highly-scalable, interactive, consumer-facing web application.</p> </li>   <li>    <p>Participate in all things JavaScript at Udemy, including</p> <ul>        <li>        <p>assessment of JavaScript-related technologies.</p>       </li>       <li>        <p>measurement and optimization of front-end performance</p>        </li>       <li>        <p>best practices and application of design patterns patterns for JavaScript (including ES6)</p>        </li>   </ul>   </li>   <li>    <p>Develop full-stack, end-to-end features for Udemy’s core teaching and learning platform.</p>   </li>   <li>    <p>Plan, organize, and get work done in 2-week agile sprints.</p>   </li>   <li>    <p>Participate in code reviews and post-deployment site monitoring.</p> </li>   <li>    <p>Contribute to a team culture that values quality, robustness, and scalability while fostering initiatives and innovation.</p>    </li>   <li>    <p>Mentor fellow team members.</p>  </li></ul><p> </p><p><strong>Qualifications:</strong></p><p> </p><ul> <li>    <p>Passion for teaching and learning.</p>   </li>   <li>    <p>Expert knowledge of web applications and HTTP (including firewalls, caches, CDNs, and the like).</p> </li>   <li>    <p>A love of (and healthy disdain for) JavaScript.</p>  </li>   <li>    <p>Knowledge of object-oriented design and computer science fundamentals (data structures, algorithms).</p> </li>   <li>    <p>Experience with frontend JavaScript including</p>    <ul>        <li>        <p>modern frameworks, Angular, Backbone, Ember, React, or Meteor (at least two of them, and one in production)</p>      </li>       <li>        <p>JavaScript dependency, build, and packaging mechanisms (e.g., gulp, grunt, bower, systemjs)</p>      </li>       <li>        <p>ES6</p>      </li>       <li>        <p>tuning the front-end of web applications.</p>        </li>   </ul>   </li>   <li>    <p>Experience with</p>  <ul>        <li>        <p>RDMBS and SQL</p>        </li>       <li>        <p>ORMs (preferably Django, but Rails, or others are OK)</p>        </li>       <li>        <p>Python</p>       </li>       <li>        <p>Linux/unix</p>       </li>       <li>        <p>testing, including back-end and front-end unit and integration tests</p>     </li>   </ul>   </li>   <li>    <p>Ability to learn, work with, and migrate existing code bases.</p>    </li>   <li>    <p>Strong technical communication skills.</p>   </li>   <li>    <p>Previous success as an individual contributor, having delivered major initiatives from inception to deployment.</p>  </li>   <li>    <p>Willingness to &quot;go the extra mile&quot; when needed.</p>  </li></ul><p>    </p><p><strong>Nice to Have:</strong></p><p> </p><ul>  <li>    <p>Contribution to public open source project(s).</p>   </li>   <li>    <p>Experience teaching.</p> </li>   <li>    <p>Experience with NoSQL and HTTP2/SPDY.</p>    </li></ul><p> </p><p><strong>Udemy in the News:</strong></p><p><a href=\"http://techcrunch.com/2015/06/02/udemy-raises-another-65-million-to-help-anyone-learn-anything/\"><u>TechCrunch: Udemy Raises Another $65 Million To Help Anyone Learn Anything</u></a></p><p><a href=\"https://press.udemy.com/wall-street-journal-udemy-raises-65-million-to-become-netflix-for-education/\"><u>Wall Street Journal: Udemy Raises $65 Million to Become Netflix for Education</u></a></p><p><a href=\"https://press.udemy.com/bloomberg-why-linkedin-is-tapping-into-online-education/\"><u>Bloomberg: Why LinkedIn Is Tapping Into Online Education</u></a></p><p><a href=\"http://www.forbes.com/sites/jacobmorgan/2015/02/05/closing-the-skills-gap-how-udemy-is-helping-anyone-learn-anything/\"><u>Forbes: Closing The Skills Gap: How Udemy Is Helping Anyone Learn Anything</u></a></p><p><a href=\"http://www.sfgate.com/news/article/Company-culture-collaboration-is-focus-at-Udemy-5969827.php#photo-7299307\"><u>SFGate: Company culture, collaboration is focus at Udemy</u></a></p> <img src=\"https://www.applytracking.com/track.aspx/6QiVJ\"/></p>\n",
"how_to_apply": "<p><a href=\"https://www.applytracking.com/track.aspx/6QiVT\">https://www.applytracking.com/track.aspx/6QiVT</a></p>\n",
"company": "Udemy",
"company_url": null,
"company_logo": null,
"url": "http://jobs.github.com/positions/e7d2d1a8-2bf4-11e5-83d1-ccd162021c71"
},
{
"id": "3c7de16a-2b38-11e5-838f-f88e3f8e6deb",
"created_at": "Wed Jul 15 21:28:13 UTC 2015",
"title": "Engineering Lead/Manager",
"location": "Palo Alto",
"type": "Full Time",
"description": "<p>Description:\nMachine Zone looking for a highly technical Software Engineering Manager to join our Data Platform Team.  You will drive technical projects and provide leadership for a group of engineers in an innovative and fast paced environment. You will be responsible for the overall planning, execution, and success of the projects. This is a first line Manager role with responsibility for managing 5-8 Software and Quality Engineers.</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Provide technical guidance, career development, and mentoring to team members.<br></li>\n<li>Assign areas of ownership, ensure engineers have clear priorities and adequate resources.</li>\n<li>Drive innovation and manage complex technical projects.<br></li>\n<li>Maintain high morale and motivate engineers to go above and beyond.<br></li>\n<li>Daily management of objectives, priorities, tradeoffs, risk and performance management of all reporting staff.</li>\n<li>Participate in architecture discussions and planning with Product Management and other stakeholders to deliver software that meets customer needs</li>\n<li>Communicate status, risks, and offer mitigation strategies to ensure on-time delivery of all committed projects to cross functional teams and high-level management.</li>\n<li>Hire top talent &amp; manage out decisively.</li>\n</ul>\n\n<p>Requirements:</p>\n\n<ul>\n<li>5+ years software development experience with a distinguished track record on technically demanding projects.<br></li>\n<li>2+ years relevant experience managing large, fast-paced and dynamic engineering teams.</li>\n<li>Experience in managing complex projects that require a deep understanding of the application logic and dependencies</li>\n<li>Strong technical skills in Object-Oriented Programming, database and server-side development. </li>\n<li>Establish credibility with smart engineers quickly.</li>\n<li>Ability to motivate people, instill accountability and achieve results.</li>\n<li>Strong verbal and written communication skills, impeccable organizational and time management skills.</li>\n<li>Experience in short release cycles, the full software lifecycle, and have worked on products that were actually released for public consumption.</li>\n<li>Bachelor&#39;s Degree. A BS in CS or EE preferred.</li>\n</ul>\n\n<p>Nice to Have:</p>\n\n<ul>\n<li>Experience in agile development methodologies such as scrum.<br></li>\n<li>Prior development or management experience with big data or ad tech platforms.<br></li>\n</ul>\n\n<p>$1000 REFERRAL BONUS!\nRefer a Friend:</p>\n\n<p>We rely on your referrals for our success, and to show our appreciation, Machine Zone offers a Referral Bonus Program.  If you refer someone to us for a full-time position and we hire them, you will receive a $1000 referral bonus after 90 days of successful employment. Certain rules, restrictions, and eligibility requirements apply. To make a referral or to learn more about the Referral Bonus Program, please contact us at <a href=\"mailto:referral@machinezone.com\">referral@machinezone.com</a>.</p>\n\n<p>Top Reasons to Join Us:</p>\n\n<p>Be part of the most innovative mobile gaming company with phenomenal growth opportunities\nCompetitive compensation package, bonus initiative plans, 401K, full health benefits, ST/LT insurance and flexible vacation\nOnsite massages, Caltrain Go Pass, cell phone reimbursement...and more!\nSnacks, drinks, lunches and dinners\nCompany events: offsite mixers, game nights, team building, holiday party, ping pong table, video games and more!\nAbout Us:</p>\n\n<p>Founded in 2008 and based in Palo Alto, California, Machine Zone, Inc. (formerly Addmired, Inc.) is a technology-focused mobile gaming company building the best global real-time hardcore MMOs.  Winner of the 2010 Crunchies Award (TechCrunch), we have had over 50 million downloads and over 15 successful top grossing titles, including previous hits such as iMob, Original Gangstaz, and Global War.  Our current top grossing title, Game Of War - Fire Age, is the #1 Grossing iOS Game in 20 countries and Top 5 Grossing in over 80 countries. With exploding revenue growth and an unwavering focus on technological innovations, we are always looking for exceptional talents from around the world to help build a great gaming company.  We are a Y-Combinator company that operates profitably with two rounds of funding from Anthos Capital, Baseline Ventures and Menlo Ventures.  </p>\n\n<p>Machine Zone does not accept unsolicited agency resumes.  Please do not forward unsolicited agency resumes to our website, employees or Human Resources.  Machine Zone will not pay fees for unsolicited agency resumes and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Machine Zone and will be processed accordingly without fee.</p>\n",
"how_to_apply": "<p>Email your resume to <a href=\"mailto:binc@machinezone.com\">binc@machinezone.com</a></p>\n",
"company": "Machine Zone",
"company_url": "https://www.machinezone.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/fee57430-2b37-11e5-8348-812bfa2b7280.png",
"url": "http://jobs.github.com/positions/3c7de16a-2b38-11e5-838f-f88e3f8e6deb"
},
{
"id": "2498b0aa-2afe-11e5-85d9-ca8734db8c71",
"created_at": "Wed Jul 15 14:31:28 UTC 2015",
"title": " Senior Engineer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>JOIN US A SR. ENGINEER - SEARCH RELEVANCE</p>\n\n<p>Target is one of the world’s most recognized brands and one of America’s leading retailers. But behind the brand our guests love, is a culture of continual innovation – and right now, we are up to big things. The Target Technology Team is driving a transformation in retail, one that will move us from “ and online” to “ and everywhere else.” Our goal is to deliver Target’s unique “Expect More. Pay Less.” promise to guests wherever and whenever they shop, today and tomorrow: in-store, online, on tablets and mobile phones, and in the retail channels of the future.</p>\n\n<p>You can be a part of developing and launching new services that power all the channels where Target does and will do business – in-store, web, tablet, mobile, and future channels. You’ll have the opportunity to design, develop and support innovative solutions across a variety of applications, platforms and environments, building tomorrow’s technologies in Search, Browse, Product Info, Promotions, Content and Checkout. You’ll put your skills, experience and passion to work in an entrepreneurial environment where success is rewarded.</p>\n\n<p>We are looking for highly motivated engineering professionals who can connect the in-store experience to the digital environment by creating scalable and seamless multi-channel experiences without losing the brand we are known for. Individuals in this role will have opportunities to gain a large breadth of knowledge by working with experts in the eCommerce, multichannel retail, product management and software engineering fields.</p>\n\n<p>As an engineer, you are a software developer with an entrepreneurial streak. You will build great products - ready to do whatever it takes to build scalable guest focused, world-class eCommerce applications for the Sr. Engineer. You like resolving complex business problems and find innovative solutions. You love keeping abreast of the latest industry trends and use them to help you innovate. You have strong leadership qualities, great judgment, clear communication skills and a track record of delivering great products.\nKey Responsibilities:</p>\n\n<ul>\n<li>Lead and develop search relevance features on our ecommerce search engine</li>\n<li>Define search metrics to validate and qualify search relevance on the engine</li>\n<li>Unit test code and create automated test scripts</li>\n<li>Lead discussions with other engineers and partners to ensure development meets business needs</li>\n<li>Follow industry standard agile software design methodology for development and technical documentation</li>\n<li>Research related products and implement innovative solutions</li>\n<li>Mentor other engineers across product development teams</li>\n<li>Innovate constantly and maintain the technical edge</li>\n</ul>\n\n<p>Minimum Qualifications:</p>\n\n<ul>\n<li>5+ years of software development experience with at least one full cycle implementation from requirement to production</li>\n<li>Experience in one or more of these areas: Search Relevancy, Search metrics measurement, Query Classification, Lexical Matching, Dynamic ranking and Static Ranking</li>\n<li>Excellent problem solver, data mining, and search algorithm development skills</li>\n<li>Strong sense of ownership and the ability to work with a limited set of requirements</li>\n<li>Team attitude</li>\n<li>Strong verbal and written communication skills – able to document and share design and specifications with team members and partners.</li>\n</ul>\n\n<p>Desired Qualifications:</p>\n\n<ul>\n<li>BS degree in computer science or equivalent</li>\n<li>eCommerce experience with a track record of innovation</li>\n<li>Extensive experience working in an agile environment (i.e. user stories, iterative development, etc.)</li>\n<li>Experience with search engine development; relevance metrics measurement, such as NDCG, CTR, CTS; query understanding and classifier; and ecommerce data mining</li>\n<li>Solr experience on Query Parser, Relevance Score calculation, Query Field design, Function Query</li>\n<li>Coding experience in Solr/Lucene Plugins and extensions</li>\n<li>Expertise in one or more of the following areas: search simulations, lexical matching, fuzzy matching technique, document static ranking, dynamic ranking, relevance tuning</li>\n</ul>\n\n<p>Apply URL: <a href=\"http://track.tmpservice.com/ApplyClick.aspx?id=2274989-2902-6574\">http://track.tmpservice.com/ApplyClick.aspx?id=2274989-2902-6574</a></p>\n",
"how_to_apply": "<p>Apply at: <a href=\"http://track.tmpservice.com/ApplyClick.aspx?id=2274989-2902-6574\">http://track.tmpservice.com/ApplyClick.aspx?id=2274989-2902-6574</a></p>\n",
"company": "Target",
"company_url": "http://jobs.target.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/0eb71416-2afe-11e5-9b0d-5c1c32765f0d.jpg",
"url": "http://jobs.github.com/positions/2498b0aa-2afe-11e5-85d9-ca8734db8c71"
},
{
"id": "fb549492-2a77-11e5-9cd9-cf217b9e7821",
"created_at": "Tue Jul 14 23:15:17 UTC 2015",
"title": "Lead Notifications Engineer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p><strong>Job Description</strong>\nFrom powering group purchases with your friends to renting out entire music venues to bring your favorite artists to you, notifications are an essential part of the user experience. Every single push notification, email, or SMS brings huge smiles to our users&#39; faces knowing that they are one step closer to making something happen. We&#39;re just at the very beginning of distributing the amazing activities that happen on our platform and want to tap into new technologies to make sure important information is delivered as timely and personalized as possible.\nAs the lead notifications engineer, you’ll help us innovate across multiple communication channels and systems so we can build best in class notifications. You understand that speed is survival and will be working with extremely experienced, ambitious, and resourceful engineers and product managers who are passionate about raising the bar for user experience and notifications.\n<strong>What You’ll Do</strong></p>\n\n<ul>\n<li>Develop a deep understanding of the various services and applications that come together to deliver all types of notifications.</li>\n<li>Play a critical part in designing the architecture, code, testing, and deploy process for new features and for improving existing ones.</li>\n<li>Introduce new tools, plugins, and frameworks to help increase development speed and discover failures/issues in a timely fashion.</li>\n<li>Regularly perform critical analysis and code reviews of your peers’ code, and you will proactively tackle problems and issues as they arise.</li>\n<li>Be the first point of contact for triaging problems reported in the various messaging systems.</li>\n<li>Work with other engineers to identify root cause and resolve issues, and pro-actively communicate impact and resolution.</li>\n</ul>\n\n<p><strong>What We’re Looking For</strong></p>\n\n<ul>\n<li>You will need to know good RESTful API design.  </li>\n<li>Experience working in a continuous delivery environment: we push the site to production several times a day - downtime is not acceptable!</li>\n<li>Experience designing scalable systems that properly balance performance, reliability and consistency.</li>\n<li>Experience with high volume notification channels: email, push notifications, SMS.</li>\n<li>Able to effectively work with Product Managers to come up with actionable roadmap and break complex systems and features into phased deliverables.</li>\n<li>Are able to handle and deliver on multiple competing priorities in a fast-paced environment.</li>\n<li>Are a great person that willingly collaborates, listens, and cares about your peers and team.</li>\n<li>Operational experience being responsible for critical production workflows.</li>\n<li>Experience working with a relational database system (e.g. MySQL, PostgreSQL).<br></li>\n</ul>\n\n<p><strong>About Tilt</strong>\nTilt is the fastest growing company in the crowdfunding space. Launching out of Y-Combinator three years ago, we’re launching more crowdfunding campaigns per day than any other platform in the world by focusing on what crowdfunding will look like in a mobile world. Tilt has raised over $70 million in funding from Andreessen Horowitz, SV Angel, Y-Combinator, and others.</p>\n",
"how_to_apply": "<p><a href=\"https://www.tilt.com/learn/jobs?gh_jid=69335\">Apply here</a></p>\n",
"company": "Tilt",
"company_url": "http://tilt.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/f71dbe44-2a77-11e5-8f41-101f3d3df391.png",
"url": "http://jobs.github.com/positions/fb549492-2a77-11e5-9cd9-cf217b9e7821"
},
{
"id": "45f1ce74-2a79-11e5-8ba9-bce2848c79e7",
"created_at": "Tue Jul 14 23:15:17 UTC 2015",
"title": "API/Back End Engineer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p><strong>Overview</strong>\nWe&#39;re looking for a well-rounded backend developer to help make our product the best it can be.  We value ambitious developers that are eager to move quickly and GetS**tDone.  You will work along side our talented API team to tackle new features, create new payment solutions, scale and document our API, and make the entire Tilt platform as easy to use as possible.\nWe believe that speed is survival and are incredibly passionate about what we do. We question the status quo and learn from each other every day.\n<strong>What You’ll Do</strong></p>\n\n<ul>\n<li>Play a critical part in designing the architecture, code, testing, and deploy process for new features and for improving existing ones.</li>\n<li>Introduce new tools, plugins and frameworks to our ecosystem to help increase development speed.  </li>\n<li>Regularly perform critical analysis and code reviews of your peers’ code, and you will proactively tackle problems and issues as they arise.</li>\n</ul>\n\n<p><strong>What We’re Looking For</strong></p>\n\n<ul>\n<li>Excellent grasp of RESTful API design.</li>\n<li>Well-versed in testing your code (unit tests, systems tests, etc.) and continuous integration.</li>\n<li>Very comfortable with the Git branching and merging model.</li>\n<li>At home in a Linux environment.</li>\n<li>Relational database experience (raw queries and ORMs).</li>\n</ul>\n\n<p><strong>What Would Be Nice To Have</strong></p>\n\n<ul>\n<li>API Design and implementation experience.</li>\n<li>Experience with payment systems and payments APIs.</li>\n<li>PostgreSQL experience.\n*Presence in the open source community.</li>\n<li>Perl and/or Dancer experience (or similar language, such as Go, Python, Ruby).</li>\n</ul>\n\n<p><strong>About Tilt</strong>\nTilt is the fastest growing company in the crowdfunding space. Launching out of Y-Combinator three years ago, we’re launching more crowdfunding campaigns per day than any other platform in the world by focusing on what crowdfunding will look like in a mobile world. Tilt has raised over $70 million in funding from Andreessen Horowitz, SV Angel, Y-Combinator, and others.</p>\n",
"how_to_apply": "<p><a href=\"https://www.tilt.com/learn/jobs?gh_jid=8920\">Apply here</a></p>\n",
"company": "Tilt",
"company_url": "http://tilt.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/419159c6-2a79-11e5-9c1e-c5201ff77010.png",
"url": "http://jobs.github.com/positions/45f1ce74-2a79-11e5-8ba9-bce2848c79e7"
},
{
"id": "4d788660-2a79-11e5-8e97-82a50e59acec",
"created_at": "Tue Jul 14 23:15:17 UTC 2015",
"title": "Front End Engineer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p><strong>What You Will Do</strong>\nAmazing activities happen every day on our platform. As an integrated part of our passionate Growth team, you’ll obsess over helping our users tilt their ideas into reality. You understand that speed is survival and are energized by tackling projects to build tools, run experiments, and ship features that help the rest of the team work smarter and our company grow.\nCollaborating closely with the Growth, Product, and Engineering teams, you’ll brainstorm, build, and execute features to increase user acquisition, retention, and engagement. You can assess our core product flows and identify where there might be opportunities to better build growth into the product. You love metrics and fast-paced execution and are motivated by results and rapid experimentation that improves our business.\n<strong>Requirements</strong></p>\n\n<ul>\n<li>Experience working in a continuous delivery environment: we push the site to production several times a day - downtime is not acceptable!</li>\n<li>Familiarity with a modern application server (Django, Express, Sinatra).</li>\n<li>Excellent understanding of MVC or similar architecture patterns.</li>\n<li>Excellent understanding of API design (both within an application and with external services through REST).</li>\n<li>Strong drive to “look under the hood” and understand the abstractions of the stack and tools.</li>\n</ul>\n\n<p><strong>Nice-To-Haves</strong></p>\n\n<ul>\n<li>Internationalization and localization experience.</li>\n<li>Specific experience with React/Flux.</li>\n<li>Familiarity with payment systems.</li>\n<li>Experience developing responsive web applications and mobile-optimized interfaces.</li>\n</ul>\n\n<p><strong>About Tilt</strong>\nTilt is the fastest growing company in the crowdfunding space. Launching out of Y-Combinator three years ago, we’re launching more crowdfunding campaigns per day than any other platform in the world by focusing on what crowdfunding will look like in a mobile world. Tilt has raised over $70 million in funding from Andreessen Horowitz, SV Angel, Y-Combinator, and others.</p>\n",
"how_to_apply": "<p><a href=\"https://www.tilt.com/learn/jobs?gh_jid=8116\">Apply here</a></p>\n",
"company": "Tilt",
"company_url": "http://tilt.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/4acaee1c-2a79-11e5-91c1-0b113a6442d8.png",
"url": "http://jobs.github.com/positions/4d788660-2a79-11e5-8e97-82a50e59acec"
},
{
"id": "533ef99e-2a79-11e5-9de1-674c19b36a4d",
"created_at": "Tue Jul 14 23:15:17 UTC 2015",
"title": "Full Stack Growth Engineer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p><strong>What You Will Do</strong>\nAmazing activities happen every day on our platform. As an integrated part of our passionate Growth team, you’ll obsess over helping our users tilt their ideas into reality. You understand that speed is survival and are energized by tackling projects to build tools, run experiments, and ship features that help the rest of the team work smarter and our company grow.\nCollaborating closely with the Growth, Product, and Engineering teams, you’ll brainstorm, build, and execute features to increase user acquisition, retention, and engagement. You can assess our core product flows and identify where there might be opportunities to better build growth into the product. You love metrics and fast-paced execution and are motivated by results and rapid experimentation that improves our business.\n<strong>Requirements</strong></p>\n\n<ul>\n<li>Exceptional proficiency using HTML/CSS/Javascript (ReactJS a nice-to-have).</li>\n<li>Some back-end knowledge. Ideally, you&#39;ve had experience writing a REST API, working with large pre-existing codebases, experience writing a REST API, working with large pre-existing codebases, and have some experience with a relational database system (e.g. PostgreSQL or MySQL).</li>\n<li>Intelligent. Highly adaptable. Rapid learner.</li>\n<li>Mastery of at least one high level scripting language: Python, Ruby, Lua, JS.</li>\n<li>Experience in A/B testing and structured experimentation.</li>\n<li>A deep understanding of the web technology stack (HTTP, HTML, CSS, web-to-app deep-linking, browser performance and cross-browser quirks).</li>\n<li>Comfort working in a fast and iterative continuous delivery environment (testing, Git branching workflows, code reviews, and deployment).</li>\n</ul>\n\n<p><strong>What We’re Looking For</strong></p>\n\n<ul>\n<li>An excitement to write code that directly impacts the growth of our business.</li>\n<li>An ability to go deep, combined with an appreciation of the challenge of going broad.</li>\n<li>Basic understanding of user acquisition + re-engagement for consumer/social products.</li>\n<li>An ability to bring libraries and tools to the rest of the company and to encourage growth tactics on all engineering teams.</li>\n<li>Experience developing responsive web applications and mobile-optimized interfaces.</li>\n<li>An ability to come up with growth ideas of your own and to run with those experiments.</li>\n<li>Experience with analytics libraries and best practices around customer tracking.</li>\n<li>Ability to work with designers and product team.  </li>\n<li>Experience with Sketch/Photoshop/Illustrator.</li>\n<li>Major Plus: Experience developing iOS or Android applications.</li>\n</ul>\n\n<p><strong>About Tilt</strong>\nTilt is the fastest growing company in the crowdfunding space. Launching out of Y-Combinator three years ago, we’re launching more crowdfunding campaigns per day than any other platform in the world by focusing on what crowdfunding will look like in a mobile world. Tilt has raised over $70 million in funding from Andreessen Horowitz, SV Angel, Y-Combinator, and others.</p>\n",
"how_to_apply": "<p><a href=\"https://www.tilt.com/learn/jobs?gh_jid=73995\">Apply here</a></p>\n",
"company": "Tilt",
"company_url": "http://tilt.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/51ae8356-2a79-11e5-9afc-6d7f7036fed8.png",
"url": "http://jobs.github.com/positions/533ef99e-2a79-11e5-9de1-674c19b36a4d"
},
{
"id": "14aa0a36-2a77-11e5-9e91-0989d3900f0a",
"created_at": "Tue Jul 14 22:45:17 UTC 2015",
"title": "Database Administrator",
"location": "San Francisco",
"type": "Full Time",
"description": "<p>Join Consensus as a Database Administrator!</p>\n\n<p>Consensus is looking for a bright, enthusiastic, hard-working, and creative candidate to join our Information Technology team as a Database Administrator. The ideal candidate will have experience in delivering right-sized and highly available database systems in an Omni-Channel retail environment.  The candidate will serve as the DevOps owner for planning and delivering databases in various technologies.  Candidate will also provide production support and issue resolution for all non-production and production databases. </p>\n\n<p>WHAT YOU WILL BE LIVING AND BREATHING EACH DAY:</p>\n\n<ul>\n<li>Participate in project and scrum teams associated with new business functionality where new databases or modifications to current databases may be required</li>\n<li>Own the right-sizing of database infrastructure based on projected load volume</li>\n<li>Determine and deliver best method for high-availability and redundant database architecture within a complex application with multiple database stacks</li>\n<li>Work in tandem with the security team to ensure all security requirements are delivered protecting company and customer data</li>\n<li>Monitor database performance for proactive actions preventing production issues impacting full customer base</li>\n<li>Work with external technology partners to minimize TCO and maximize performance</li>\n</ul>\n\n<p>WHAT YOU BRING TO THE TABLE:</p>\n\n<p>Minimum Requirements</p>\n\n<ul>\n<li>Bachelors’ degree or equivalent experience in a related area</li>\n<li>5+ years IT related experience in Database design, support and deployment</li>\n<li>Advance technical knowledge and hands-on expertise with the database administration and troubleshooting in a highly dynamic and customer focused application environment</li>\n<li>Must have provided production database support</li>\n<li>Additional requirements listed under competencies</li>\n<li>Understanding of cloud-based infrastructures (AWS, IBM, RackSpace) and complexities of running high availability database environments</li>\n<li>Certifications or working knowledge of databases including MySQL, Oracle, MongoDB, PostgreSQL</li>\n<li>Strong DevOps and continuous delivery methods experience with familiarity of tools including Jira, Confluence, Jenkins, Splunk and Git</li>\n<li>History of end to end Database delivering including capacity planning, performance testing, stress testing, replication and clustering, Disaster Recovery and monitoring and alerting for maximum up-time</li>\n<li>Strong analytical skills and proven problem solving ability</li>\n<li>Action oriented and the ability to work in a fast paced delivery driven environment</li>\n<li>Self-motivated, takes initiative, curious</li>\n</ul>\n\n<p>HOW TO APPLY:</p>\n\n<p>Email <a href=\"mailto:Melissa.Chu@target.com.In\">Melissa.Chu@target.com.In</a> the SUBJECT FIELD, note “Database Administrator” and ATTACH your Word or PDF resume.</p>\n\n<p>Consensus is an Equal Opportunity Employer</p>\n\n<p>*SAN FRANCISCO POSITIONS: Consensus will consider for employment qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance.</p>\n",
"how_to_apply": "<p>Email your resume to <a href=\"mailto:Melissa.Chu@target.com\">Melissa.Chu@target.com</a></p>\n",
"company": "Consensus",
"company_url": null,
"company_logo": "http://github-jobs.s3.amazonaws.com/100d0744-2a77-11e5-9664-db1584a00a64.jpg",
"url": "http://jobs.github.com/positions/14aa0a36-2a77-11e5-9e91-0989d3900f0a"
},
{
"id": "9db64274-6100-11e2-8463-e034bf56eb72",
"created_at": "Mon Jul 13 23:50:04 UTC 2015",
"title": "Site Reliability Engineer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>Our Site Reliability Engineers are the primary interface between our developers and our production operations. No matter how many times we get searched, scraped, scanned, spammed, pinged, paged or queried, they gotta keep their cool - and keep the site running smoothly. You&#39;ll work in both the dev and systems worlds, instrumenting key parts of core architecture and supporting devs as they try to do the same. We&#39;re looking for a true hacker - you&#39;ll work as much in bash as Python, and you&#39;ll drop into some C now and then. You&#39;ll implement monitoring and alerting systems to support site stability and performance. You&#39;ll proactively scale our infrastructure to meet ever-increasing demand. You&#39;ll make sure that when something goes bump in the night, someone hears it. And you&#39;ll play a key role in keeping Yelp fast, available and growing.</p>\n\n<p><strong>Responsibilities</strong></p>\n\n<ul>\n<li>Work closely with developers in supporting new features and services</li>\n<li>Monitor site stability and performance</li>\n<li>Scale infrastructure to meet demand</li>\n<li>Troubleshoot site issues</li>\n<li>Develop custom tools as necessary</li>\n<li>Document system design and procedures</li>\n<li>Participate in light on-call rotation</li>\n</ul>\n\n<p><strong>Requirements</strong></p>\n\n<ul>\n<li>Mastery of Linux or Unix</li>\n<li>Command of your favorite modern programming language: Python, Ruby, Java, C++, etc.</li>\n<li>Solid understanding of fundamental technologies like TCP/IP, HTTP,</li>\n<li>Knowledge of best practices related to security, performance, and disaster recovery</li>\n<li>Strong scripting skills in the presence of flying darts</li>\n<li>Experience with web server configuration, monitoring, trending, network design, high availability</li>\n<li>Excellent communication skills</li>\n<li>A sense of humor!</li>\n</ul>\n\n<p><strong>Pluses</strong></p>\n\n<ul>\n<li>MySQL experience (high availability, scale-out replication)</li>\n<li>Advanced knowledge of network design, management of Cisco network equipment, or BGP</li>\n<li>Experience at a large-scale consumer internet site</li>\n<li>CentOS and Ubuntu distribution familiarity</li>\n</ul>\n",
"how_to_apply": "<p><a href=\"https://jobs.lever.co/yelp/d33fe4e7-f48f-40a1-9a0a-a6987e41d49e?lever-source=Github\">Apply here</a></p>\n",
"company": "Yelp",
"company_url": "http://www.yelp.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/9504e676-6100-11e2-9832-e380a5431fcc.jpg",
"url": "http://jobs.github.com/positions/9db64274-6100-11e2-8463-e034bf56eb72"
},
{
"id": "25a4b214-f8ea-11e4-934c-f21be90de5f1",
"created_at": "Mon Jul 13 21:02:06 UTC 2015",
"title": "Senior Back End Engineer, Eligibility",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>Rally Health (<a href=\"http://www.rallyhealth.com\">www.rallyhealth.com</a>) has a mission to convert healthcare into a consumer-centric platform. </p>\n\n<p>We’re building an ecosystem of distributed services using Scala / Akka / Play web applications communicating over HTTP and a distributed message bus and deployed on AWS with Chef, Mesos, and Docker. Join a fun and agile team of talented engineers, learn new skills, and architect successful solutions that can keep up with our high rate of growth!</p>\n\n<p><strong>About you:</strong></p>\n\n<ul>\n<li>Have a passion to reinvent health care; to make it better for the consumer and optimized for our partners</li>\n<li>Eager to gain valuable experience and grow quickly, along with the rest of us, as we roll our product out to our millions of eligible users</li>\n<li>Want to make a difference. The products we build as we grow have the opportunity to revolutionize the way people interact with healthcare</li>\n</ul>\n\n<p><strong>Experience relevant to this role:</strong></p>\n\n<ul>\n<li>An understanding of the challenges with scaling in complex, distributed systems</li>\n<li>Familiarity with SOA and the ability to debug errors within a distributed services environment</li>\n<li>Java (4+ years), C# (4+ years), or Scala (2+ years)</li>\n<li>Familiarity with both NoSQL and RDBMS databases, especially their strengths and weaknesses</li>\n<li>Working in a high-traffic production environment with strict SLA requirements</li>\n<li>Building, shipping and scaling REST-ful services</li>\n<li>Solid computer science fundamentals, problem solving, and analytical skills</li>\n<li>Clear communication skills and a strong sense of ownership of seeing things through</li>\n</ul>\n\n<p><strong>Bonus points for having experience with:</strong></p>\n\n<ul>\n<li>Developing, monitoring and managing distributed applications under heavy traffic</li>\n<li>Test driven development</li>\n<li>Functional programming</li>\n<li>Programming with the actor model</li>\n<li>AWS (configuring, deploying, managing, monitoring) services and distributed applications</li>\n<li>Understanding various SDLC processes including agile (i.e. scrum), waterfall</li>\n<li>Distributed systems architecture experience, with API contract definition</li>\n<li>Chef or similar (Ansible, SaltStack, etc)</li>\n</ul>\n\n<p>Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records</p>\n",
"how_to_apply": "<p><a href=\"http://grnh.se/tin6ba\">Apply here</a></p>\n",
"company": "Rally Health",
"company_url": "http://www.rallyhealth.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/073f2bb0-f8ea-11e4-952c-c444889307f8.png",
"url": "http://jobs.github.com/positions/25a4b214-f8ea-11e4-934c-f21be90de5f1"
},
{
"id": "954b85be-5a97-11e2-9200-db7eecfdb6d8",
"created_at": "Mon Jul 13 20:03:06 UTC 2015",
"title": "Software Engineer - Infrastructure",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p><em>About the teams:</em></p>\n\n<p>Yelp&#39;s Search &amp; Data Mining, Ads, and Spam Prevention teams run services that respond to hundreds of requests every second. Each and every query must be lightning fast, 24/7/365. This means our infrastructure needs to be both speedy and reliable. It also needs to make efficient use of resources and be easy to use for relevance/machine learning developers to modify and improve.</p>\n\n<p>Your core responsibility will be helping to define and build that long-term vision of a fast, reliable, efficient, and ductile search infrastructure. So get your infra mojo on and join us!</p>\n\n<p><em>Things we like:</em></p>\n\n<ul>\n<li>Prior experience with production large-scale distributed systems.</li>\n<li>Demonstrated ability to work with a large amount of independence and responsibility.</li>\n<li>Ability to work closely with information retrieval/machine learning experts on big-data problems. Some interest and familiarity with IR/ML is a plus, but it will not be your primary focus.</li>\n<li>Prior experience with Lucene, ElasticSearch, Hadoop/mrjob, or large data stores (MySQL or NoSQL - we just want the right solution for the situation).</li>\n<li>A hunger for tracking down root causes -- no matter how deep it takes you -- and fixing them in systematic ways.</li>\n<li>We use Java &amp; Python. You don’t need to be an expert, but experience is a plus and we will expect you to learn them on the job.</li>\n<li>Minimum BA/BS degree in Computer Science, Math, or related degree</li>\n<li>A sense of humor and excellent aim with Nerf darts.</li>\n</ul>\n",
"how_to_apply": "<p><a href=\"https://jobs.lever.co/yelp/53198a94-0808-491b-83cd-18c6eb6dc27a?lever-source=Github\">Apply here</a></p>\n",
"company": "Yelp",
"company_url": "http://www.yelp.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/918c8f72-5a97-11e2-9d91-411f41c4da39.jpg",
"url": "http://jobs.github.com/positions/954b85be-5a97-11e2-9200-db7eecfdb6d8"
},
{
"id": "3133861e-ca65-11e3-8a9b-62a2c4033f6d",
"created_at": "Mon Jul 13 19:28:23 UTC 2015",
"title": "Backend Web Engineer (PHP)",
"location": "San Francisco / Remote",
"type": "Full Time",
"description": "<p>Creative Market is a platform for handcrafted, mousemade design content from independent creators around the world, and we’re passionate about making beautiful design simple and accessible to everyone. During our first year, we’ve grown over 1600% and helped our shop owners earn millions of dollars doing what they love, and we need your help to continue building the platform that powers the best place to buy and sell digital design assets.</p>\n\n<p><strong>Sorry, but this is for people able to work in the U.S. only.</strong></p>\n\n<h2>Responsibilities:</h2>\n\n<ul>\n<li>Build, ship, curate, and iterate on Creative Market features.</li>\n<li>Work with design, product, growth, and support teams to build features.</li>\n<li>Own your work. Whether a nasty bug or an awesome feature, you put your name on every line of code.</li>\n<li>Be a team player. You love to work with others to find the right solutions.</li>\n<li>Focused on the end-user. You leave your ego at the door. You care first and foremost about the right decision being made for the customer and the product.</li>\n</ul>\n\n<h2>We&#39;re Offering:</h2>\n\n<ul>\n<li>Competitive compensation</li>\n<li>Variable pay programs</li>\n<li>Meaningful stock plans</li>\n<li>401(k) plan</li>\n<li>Medical, dental, and vision benefits</li>\n<li>Generous paid time off / sabbatical plan</li>\n<li>Full relocation benefits</li>\n</ul>\n\n<h2>About You</h2>\n\n<ul>\n<li>You must love to code.</li>\n<li>You’re a generalist who thrives on building complete features independently (front and back-end).</li>\n<li>You’re a PHP expert with a strong understanding of MySQL, Linux (Ubuntu), and Apache and are familiar with memcache, ElasticSearch, and Gearman.</li>\n<li>Experience with HTML5, CSS3/LESS, JavaScript are important, but it won&#39;t be your day-to-day.</li>\n<li>You’re passionate about building a great product.</li>\n<li>You approach problems from a product perspective, thinking through how the user will interact with what you&#39;re building.</li>\n<li>You have strong communication skills. You ask questions, let others know when you need help, and tell others what you need.</li>\n<li>You&#39;re a problem solver. You believe the best work is the result of finding the simplest solution to complex challenges.</li>\n<li>You see the big picture. You understand how the code you write interacts with systems and services, both internally and externally.</li>\n<li>You&#39;re passionate about empowering creators to get their work in front of millions of potential customers.</li>\n</ul>\n",
"how_to_apply": "<p>Fill out the form here! <a href=\"https://creativemarket.com/careers/backend-web-engineer\">https://creativemarket.com/careers/backend-web-engineer</a></p>\n",
"company": "Creative Market",
"company_url": "https://creativemarket.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/2834944a-ca65-11e3-8fa2-f7001a73a1f8.png",
"url": "http://jobs.github.com/positions/3133861e-ca65-11e3-8a9b-62a2c4033f6d"
},
{
"id": "b853a074-5a7d-11e2-9d67-f6e5a9eda78c",
"created_at": "Mon Jul 13 16:57:58 UTC 2015",
"title": "Software Engineer - Data-Mining",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p><em>About the teams:</em></p>\n\n<p>Our Search &amp; Data Mining, Ads and Spam Prevention teams see 47M+ Yelp reviews and 117M+ monthly unique visitors as one giant playground for data mining. They banter about Bandits, know their way down a Gradient, and aren’t too Naïve to kick back in our Bay(es) Area offices. We love new ideas and collaboration: don’t come here with any Prior prejudices or you will Maximize your Likelihood of getting your Posterior kicked.</p>\n\n<p>Our mission: to make Yelp psychic. When you want cheap thai delivery for dinner, your wish is our code. Looking for a memorable night out? An ad for the best local flower shop might be just the tip you need to make the night unforgettable.</p>\n\n<p>Our teams eat data for breakfast, chew it up, and spit out useful products. Saddle up and get on board!</p>\n\n<p><em>You will...</em></p>\n\n<ul>\n<li>Work with the team to come up with creative ideas for new products and signals, then carry those ideas all the way to launch.</li>\n<li>Explore data to measure the impact of your changes and come up with ideas for how to maximize that impact.</li>\n<li>Work closely with infrastructure engineers to make sure that your algorithms will effectively scale to large data sets and to ensure that their systems provide the flexibility needed for your ideas.</li>\n</ul>\n\n<p><em>You should have...</em></p>\n\n<ul>\n<li>A passion for big data, and creative ideas for what to do with it.</li>\n<li>The algorithms and data structures experience to make your ideas workable.</li>\n<li>The coding experience to turn those ideas into reality. We use Java &amp; Python. You don’t need to be an expert, but experience is a plus and we will expect you to learn them on the job.</li>\n<li>A background in Machine Learning or Information Retrieval.</li>\n<li>Minimum BA/BS degree in Computer Science, Math, or related degree</li>\n<li>A love of delighting people with local knowledge.</li>\n</ul>\n\n<p><em>Pluses...</em></p>\n\n<ul>\n<li>Experience working with ElasticSearch, Lucene, Hadoop, or mrjob</li>\n<li>Experience applying Auction theory, CTR prediction, Game theory, Graph theory, Natural language processing, Recommender systems, Spam detection, Stochastic optimization</li>\n</ul>\n",
"how_to_apply": "<p><a href=\"https://jobs.lever.co/yelp/b1e85806-9f1e-433a-9080-69b821face9c?lever-source=Github\">Apply here</a></p>\n",
"company": "Yelp",
"company_url": "http://www.yelp.com/",
"company_logo": "http://github-jobs.s3.amazonaws.com/af220d9c-5a7d-11e2-80ad-ff910efcf650.jpg",
"url": "http://jobs.github.com/positions/b853a074-5a7d-11e2-9d67-f6e5a9eda78c"
},
{
"id": "5106384c-e83a-11e1-9da2-3861b253ef89",
"created_at": "Mon Jul 13 07:08:16 UTC 2015",
"title": "Software Engineer - Web Developer",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>Our web developers are at the core of what makes Yelp the most fun and useful local business review guide. Whether it&#39;s clean interfaces, scalable servlets, or testing frameworks, they kick ass at everything. They implement whole features independently, and they iterate fast: they release code everyday.</p>\n\n<p>Requirements:</p>\n\n<ul>\n<li>Care about your users</li>\n<li>Expertise in JavaScript, HTTP, HTML/DOM, and CSS</li>\n<li>Command of programming on a web server: Python, Ruby, Java, C++, etc.</li>\n<li>Test-driven development</li>\n<li>Excitement about the challenges of internationalization</li>\n<li>Comfortable working in a Unix environment</li>\n<li>Excellent typing ability in the presence of flying nerf darts</li>\n</ul>\n\n<p>Pluses:</p>\n\n<ul>\n<li>Love of Python</li>\n<li>Battle-worn MySQL knowledge</li>\n<li>Firebug is your best friend</li>\n<li>Active contributor to open source software</li>\n<li>Mobile web development experience (XHTML)</li>\n<li>Proficiency with Fireworks, Photoshop, etc.</li>\n<li>Pointers to websites you&#39;ve built</li>\n</ul>\n",
"how_to_apply": "<p><a href=\"https://jobs.lever.co/yelp/bd07a618-9b6f-4920-91c6-99280f1b268d?lever-source=Github\">Apply here</a></p>\n",
"company": "Yelp",
"company_url": "http://www.yelp.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/4c097368-e83a-11e1-8e79-e44678e93596.jpg",
"url": "http://jobs.github.com/positions/5106384c-e83a-11e1-9da2-3861b253ef89"
},
{
"id": "d836c84c-e838-11e1-9ef7-dd74f84f9d34",
"created_at": "Mon Jul 13 06:57:44 UTC 2015",
"title": "Software Engineer - Back-end",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>It ain&#39;t easy running a site with 117M+ users and 47M+ reviews, but we do it with just a few people. This team does it all. They tame MySQL replication one day, implement a brand-new feature the next, and push it all out that night. They love being responsible for whole systems, and they love scaling those systems to the next level. But what really keeps the code flowing? Daily release cycle, baby!</p>\n\n<p>Requirements:</p>\n\n<ul>\n<li>Build systems that are simple and scale</li>\n<li>Command of your favorite modern programming language: Python, Ruby, Java, Objective-C, C++, etc</li>\n<li>Comprehensive computer-science fundamentals</li>\n<li>Excitement about the challenges of internationalization</li>\n<li>Comfortable working in a Unix environment</li>\n<li>Excellent typing ability in the presence of flying nerf darts</li>\n</ul>\n\n<p>Pluses:</p>\n\n<ul>\n<li>Love of Python</li>\n<li>Battle-worn MySQL knowledge</li>\n<li>Specific interest in local search or social networks</li>\n<li>Active contributor to open source software</li>\n<li>Command-line scripting skills</li>\n</ul>\n",
"how_to_apply": "<p><a href=\"https://jobs.lever.co/yelp/b8462217-1b5f-4a6f-a94b-ddb52f4726ad?lever-source=Github\">Apply here</a></p>\n",
"company": "Yelp",
"company_url": "http://www.yelp.com",
"company_logo": "http://github-jobs.s3.amazonaws.com/d3b80646-e838-11e1-9b29-de8827631e4d.jpg",
"url": "http://jobs.github.com/positions/d836c84c-e838-11e1-9ef7-dd74f84f9d34"
},
{
"id": "6834a19c-2730-11e5-8ccc-8a1bf5a5ab08",
"created_at": "Fri Jul 10 18:21:21 UTC 2015",
"title": "Product Marketing Manager - Platform",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>New Relic<br>\nProduct Marketing Manager - Platform\nSan Francisco, CA or Portland, OR  </p>\n\n<p>Want to join a fast-paced, rapidly growing SaaS company that’s disrupting a multi-billion dollar industry?That’s what we’re doing here each day at New Relic. We are the leading software analytics company, delivering out of this world experiences to our customers through our SaaS-delivered Software Analytics Platform.</p>\n\n<p>We thrive on providing products that help software developers, IT Operations, DevOps teams, and application owners drive better software application performance, customer experience and business outcomes.</p>\n\n<p>We are looking for a world class Product Marketing Manager to join our Product Marketing team, leading outbound product marketing activities specifically for our multitenant SaaS platform that underpins all our products. This platform includes a highly scalable cloud database, alerting, dashboards, and API gateways, all built on an supercluster capable of ingesting billions of events and querying trillions of events in less than a second. It’s an amazing set of technologies that needs an product marketer to crystallize its positioning and drive its market awareness.</p>\n\n<p>In this role you will own product &amp; competitive positioning, sales enablement, market &amp; competitive analysis, product launches, customer development, and more for our New Relic Software Analytics Platform.  </p>\n\n<p>The ideal candidate will have significant experience as a product marketing, product management, sales engineering, customer support and/or training professional at a software monitoring company targeting technical and business buyers.  </p>\n\n<p>Key Responsibilities</p>\n\n<ul>\n<li>Develop positioning and messaging that resonates with our Software Analytics Platform’s audience: IT Operations, security teams, and developers</li>\n<li>Enable the sales force by developing collateral and providing training</li>\n<li>Develop marketing collateral: datasheets, eBooks, whitepapers, presentations, etc.</li>\n<li>Perform market and competitive research and analysis</li>\n<li>Plan and manage product launch activities</li>\n<li>Work with product management and engineering to define product roadmap</li>\n<li>Present at tradeshows and conferences</li>\n</ul>\n\n<p>Requirements</p>\n\n<ul>\n<li>6+ years working in product marketing, product management, sales engineering, customer support and/or training professional at cloud, Big Data, software monitoring and/or security companies</li>\n<li>Experience positioning technical products to both technical and business buyers</li>\n<li>Demonstrated ability to distill simple positioning from complex products</li>\n<li>Technical depth and curiosity balanced with a strong business acumen</li>\n<li>Familiarity with the Big Data, cloud and security infrastructure market landscapes, including Hadoop, databases, identity management, firewalls, cryptographic software and cloud infrastructure</li>\n<li>Experience working effectively across marketing and sales organizations</li>\n<li>Excellent oral and written communication skills</li>\n</ul>\n\n<p>A little about us:</p>\n\n<p>New Relic is a software analytics company that, on behalf of our customers, makes sense of billions of metrics about millions of applications, all in real time. Our comprehensive SaaS-based solution for web and mobile applications consolidates the performance monitoring data into a single, powerful interface. Our customers use New Relic every day to optimize millions of applications. </p>\n\n<p>New Relic is a San Francisco Best Places to Work award winner, an Oregon “Top Workplace” award winner, named a leader in the Gartner’s 2013 &amp; 2014 “Magic Quadrant” for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) – the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high quality teammates, a standard-setting product, and a company on the move.</p>\n\n<p>Our office is in the tech-rich urban center of San Francisco, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up. We can help with relocation and are open to H1-B transfers. </p>\n\n<p>New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender, religion, national origin, ancestry, citizenship, individuals with disabilities, age, sexual orientation, protected veterans, or any other characteristic protected by law. Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic.  We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance.</p>\n\n<p>To get started, click on the link below. To fast track your application, let us know in your cover letter why this job, product, and/or company is of particular interest to you. We look forward to talking!</p>\n\n<h1>LI-CV1</h1>\n\n<p>Apply Here: <a href=\"http://www.Click2Apply.net/nhqvrhh\">http://www.Click2Apply.net/nhqvrhh</a></p>\n",
"how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2Apply.net/nhqvrhh\">http://www.Click2Apply.net/nhqvrhh</a></p>\n",
"company": "New Relic",
"company_url": "http://www.Click2Apply.net/nhqvrhh",
"company_logo": "http://github-jobs.s3.amazonaws.com/555c5730-3712-11e5-8fc4-e2fd8b460e8a.png",
"url": "http://jobs.github.com/positions/6834a19c-2730-11e5-8ccc-8a1bf5a5ab08"
},
{
"id": "d6556388-272f-11e5-8797-5de751f0672c",
"created_at": "Fri Jul 10 18:17:29 UTC 2015",
"title": "Product Marketing Manager - APM",
"location": " San Francisco, CA",
"type": "Full Time",
"description": "<p>New Relic<br>\nProduct Marketing Manager - APM\nSan Francisco, CA or Portland, OR  </p>\n\n<p>Want to join a fast-paced, rapidly growing SaaS company that’s disrupting a multi-billion dollar industry? That’s what we’re doing here each day at New Relic. We are the leading software analytics company, delivering out of this world experiences to our customers through our SaaS-delivered Software Analytics Platform.</p>\n\n<p>We thrive on providing products that help software developers, IT Operations, DevOps teams, and application owners drive better software application performance, customer experience and business outcomes.</p>\n\n<p>We are looking for a world class Product Marketing Manager to join our Product Marketing team, leading outbound product marketing activities specifically for our flagship New Relic APM product, the market leader for application performance management. If you’re looking to impact the IT industry, this is the role for it.</p>\n\n<p>In this role you will own product &amp; competitive positioning, sales enablement, market &amp; competitive analysis, product launches, customer development, and more for APM.  </p>\n\n<p>The ideal candidate will have significant experience as a product marketing, product management, sales engineering, customer support and/or training professional at a software monitoring company targeting technical buyers.  </p>\n\n<p>Key Responsibilities</p>\n\n<ul>\n<li>Develop positioning and messaging that resonates with APM’s audience: developers, IT Operations, and application owners</li>\n<li>Enable the sales force by developing collateral and providing training</li>\n<li>Develop marketing collateral: datasheets, eBooks, whitepapers, presentations, etc.</li>\n<li>Perform market and competitive research and analysis</li>\n<li>Plan and manage product launch activities</li>\n<li>Work with product management and engineering to define product roadmap</li>\n<li>Present at tradeshows and conferences</li>\n</ul>\n\n<p>Requirements</p>\n\n<ul>\n<li>6+ years working in product marketing, product management, sales engineering, customer support and/or training professional at software monitoring companies</li>\n<li>Experience positioning technical products to both technical and business buyers</li>\n<li>Demonstrated ability to distill simple positioning from complex products</li>\n<li>Technical depth and curiosity balanced with a strong business acumen</li>\n<li>Familiarity with the application infrastructure market landscape, including programming languages, app servers, databases, and cloud infrastructure</li>\n<li>Experience working effectively across marketing and sales organizations</li>\n<li>Excellent oral and written communication skills</li>\n</ul>\n\n<p>A little about us:</p>\n\n<p>New Relic is a software analytics company that, on behalf of our customers, makes sense of billions of metrics about millions of applications, all in real time. Our comprehensive SaaS-based solution for web and mobile applications consolidates the performance monitoring data into a single, powerful interface. Our customers use New Relic every day to optimize millions of applications. </p>\n\n<p>New Relic is a San Francisco Best Places to Work award winner, an Oregon “Top Workplace” award winner, named a leader in the Gartner’s 2013 &amp; 2014 “Magic Quadrant” for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) – the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high quality teammates, a standard-setting product, and a company on the move.</p>\n\n<p>Our office is in the tech-rich urban center of San Francisco, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up. We can help with relocation and are open to H1-B transfers. </p>\n\n<p>New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender, religion, national origin, ancestry, citizenship, individuals with disabilities, age, sexual orientation, protected veterans, or any other characteristic protected by law. Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic.  We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance.</p>\n\n<p>To get started, click on the link below. To fast track your application, let us know in your cover letter why this job, product, and/or company is of particular interest to you. We look forward to talking!</p>\n\n<h1>LI-CV1</h1>\n\n<p>Apply Here:   <a href=\"http://www.Click2Apply.net/zhyzmw5\">http://www.Click2Apply.net/zhyzmw5</a></p>\n",
"how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2Apply.net/zhyzmw5\">http://www.Click2Apply.net/zhyzmw5</a></p>\n",
"company": "New Relic",
"company_url": "http://www.Click2Apply.net/zhyzmw5",
"company_logo": "http://github-jobs.s3.amazonaws.com/555c5730-3712-11e5-8fc4-e2fd8b460e8a.png",
"url": "http://jobs.github.com/positions/d6556388-272f-11e5-8797-5de751f0672c"
},
{
"id": "5e8118dc-2722-11e5-97b4-49f0e84468c5",
"created_at": "Fri Jul 10 16:41:23 UTC 2015",
"title": "Product Marketing Manager - Synthetics",
"location": "San Francisco, CA",
"type": "Full Time",
"description": "<p>New Relic<br>\nProduct Marketing Manager - Synthetics\nSan Francisco, CA or Portland, OR  </p>\n\n<p>Want to join a fast-paced, rapidly growing SaaS company that’s disrupting a multi-billion dollar industry? That’s what we’re doing here each day at New Relic. We are the leading software analytics company, delivering out of this world experiences to our customers through our SaaS-delivered Software Analytics Platform.</p>\n\n<p>We thrive on providing products that help software developers, IT Operations, DevOps teams, and application owners drive better software application performance, customer experience and business outcomes.</p>\n\n<p>We are looking for a world class Product Marketing Manager to join our Product Marketing team, leading outbound product marketing activities specifically for our New Relic Synthetics product, one of our newest and fastest-growing products that is rapidly disrupting incumbent synthetic testing tools with fresh thinking and capabilities that customers love.</p>\n\n<p>In this role you will own product &amp; competitive positioning, sales enablement, market &amp; competitive analysis, product launches, customer development, and more for Synthetics.</p>\n\n<p>The ideal candidate will have significant experience as a product marketing, product management, sales engineering, customer support and/or training professional at a software monitoring company targeting technical and business buyers.  </p>\n\n<p>Key Responsibilities</p>\n\n<ul>\n<li>Develop positioning and messaging that resonates with Synthetics’ audience: DevOps, IT Operations, and application owners</li>\n<li>Enable the sales force by developing collateral and providing training</li>\n<li>Develop marketing collateral: datasheets, eBooks, whitepapers, presentations, etc.</li>\n<li>Perform market and competitive research and analysis</li>\n<li>Plan and manage product launch activities</li>\n<li>Work with product management and engineering to define product roadmap</li>\n<li>Present at tradeshows and conferences</li>\n</ul>\n\n<p>Requirements</p>\n\n<ul>\n<li>6+ years working in product marketing, product management, sales engineering, customer support and/or training professional at software monitoring companies</li>\n<li>Experience positioning technical products to both technical and business buyers</li>\n<li>Demonstrated ability to distill simple positioning from complex products</li>\n<li>Technical depth and curiosity balanced with a strong business acumen</li>\n<li>Familiarity with the synthetic testing market landscape, including CDNs, Selenium, programming languages, app servers, and cloud infrastructure</li>\n<li>Experience working effectively across marketing and sales organizations</li>\n<li>Excellent oral and written communication skills</li>\n</ul>\n\n<p>A little about us:</p>\n\n<p>New Relic is a software analytics company that, on behalf of our customers, makes sense of billions of metrics about millions of applications, all in real time. Our comprehensive SaaS-based solution for web and mobile applications consolidates the performance monitoring data into a single, powerful interface. Our customers use New Relic every day to optimize millions of applications.</p>\n\n<p>New Relic is a San Francisco Best Places to Work award winner, an Oregon “Top Workplace” award winner, named a leader in the Gartner’s 2013 &amp; 2014 “Magic Quadrant” for APM companies, a Top 100 OnDemand Company, Best of SaaS (THINKStrategies), Top 100 Coolest Cloud Computing (CRN); 10 Cloud Management Companies to Watch (NetworkWorld) – the list of accolades goes on. More important than all of that: we provide challenging work, opportunities to learn, high quality teammates, a standard-setting product, and a company on the move. </p>\n\n<p>Our office is in the tech-rich urban center of San Francisco, with easy commute access and a plethora of good eats. We provide competitive compensation, equity and big-company benefits (medical, dental, etc) -- all while maintaining the energy, agility, and fun of a start-up. We can help with relocation and are open to H1-B transfers.</p>\n\n<p>New Relic is most decidedly an equal opportunity employer. We eagerly seek applicants of diverse background and hire without regard to race, color, gender, religion, national origin, ancestry, citizenship, individuals with disabilities, age, sexual orientation, protected veterans, or any other characteristic protected by law. Note: Our stewardship of the data of many thousands of customers means that a criminal background check is required to join New Relic.  We will, nonetheless, consider qualified applicants with arrest and conviction records in accord with applicable law, including the San Francisco Fair Chance Ordinance.</p>\n\n<p>To get started, click on the link below. To fast track your application, let us know in your cover letter why this job, product, and/or company is of particular interest to you. We look forward to talking!</p>\n\n<h1>LI-CV1</h1>\n\n<p>Apply Here:  <a href=\"http://www.Click2Apply.net/6mvhbgy\">http://www.Click2Apply.net/6mvhbgy</a></p>\n",
"how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2Apply.net/6mvhbgy\">http://www.Click2Apply.net/6mvhbgy</a></p>\n",
"company": "New Relic",
"company_url": "http://www.Click2Apply.net/6mvhbgy",
"company_logo": "http://github-jobs.s3.amazonaws.com/555c5730-3712-11e5-8fc4-e2fd8b460e8a.png",
"url": "http://jobs.github.com/positions/5e8118dc-2722-11e5-97b4-49f0e84468c5"
}
]
