[{"id":"628817aa-316d-11e5-9473-8e33a6061b22","created_at":"Thu Jul 23 19:07:28 UTC 2015","title":"Software Developer","location":"Denver","type":"Full Time","description":"<p><strong>About Comverge:</strong></p>\n\n<p>Comverge is an industry-leading provider of integrated demand response, energy efficiency and customer engagement solutions that enable utilities to deliver cleaner, more affordable and more reliable energy. Through its combination of software, hardware and services, Comverge helps utilities optimize every aspect of a demand management program, from participant recruitment and device installation to call center support, control events and measurement and verification. Comverge has worked with hundreds of electric utilities to deploy nearly six million energy management devices and enroll more than 1.6 million residential customers into mass-market demand management programs. For more information, visit <a href=\"http://www.comverge.com\">www.comverge.com</a> and follow us on Twitter at @Comverge.</p>\n\n<p><strong>Role Summary / Purpose:</strong></p>\n\n<p>We are a Green Energy company whose software allows utilities to curtail load on the electrical grid so that they can meet demand without building more power plants. We have built the industry leading platform for doing Intelligent Energy Management of the Smart Grid. Come join one of the most ambitious and challenging Rails projects in existence.</p>\n\n<p>This position encompasses work across all tiers of our web applications. Ruby is our primary\ntool, but there is also work in JavaScript/CoffeeScript, iOS, Erlang, Redis, SQL, Cassandra,\nR and machine learning.</p>\n\n<p><strong>Why we work here:</strong></p>\n\n<p>We emphasize a healthy work/life balance. 40 hour work weeks are the norm, not the exception.\nWe write “green” software. It helps reduce the demand for coal by energy utilities and encourages more energy efficient behavior by consumers.\nOur team is made up of highly experienced developers. We foster a culture of learning and mentoring. We provide learning opportunities through conferences and training. We regularly release and contribute to open source projects.</p>\n\n<p><strong>Qualifications Requirements:</strong></p>\n\n<ul>\n<li>In-depth Ruby and Rails knowledge</li>\n<li>JavaScript experience</li>\n<li>Database layer/SQL experience</li>\n<li>Comfortable pair programming</li>\n<li>Experience with test automation and continuous intergration</li>\n<li>3 years software development experience</li>\n<li>Familiar with git</li>\n</ul>\n\n<p><strong>Differentiators:</strong></p>\n\n<ul>\n<li>Self motivated to refactor and make improvements</li>\n<li>Spurred to action when the build breaks</li>\n<li>Interests in devops</li>\n<li>Development experience in the following</li>\n<li>iOS/Android</li>\n<li>Machine Learning</li>\n<li>R</li>\n<li>Cassandra</li>\n<li>Erlang</li>\n<li>REST APIs</li>\n<li>Chef or similar</li>\n</ul>\n\n<p><strong>Benefits:</strong></p>\n\n<p>In exchange for your hard work and dedication, we offer a competitive salary, excellent benefits package and positive working environment.</p>\n\n<p>The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. </p>\n\n<p>Comverge is an Equal Employment Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of disability or veteran status.  (Minorities / Female / Disabled / Veteran)</p>\n","how_to_apply":"<p><a href=\"http://chc.tbe.taleo.net/chc06/ats/careers/requisition.jsp?org=COMVERGE&amp;cws=1&amp;rid=664\">http://chc.tbe.taleo.net/chc06/ats/careers/requisition.jsp?org=COMVERGE&amp;cws=1&amp;rid=664</a></p>\n","company":"Comverge","company_url":"http://www.comverge.com ","company_logo":"http://github-jobs.s3.amazonaws.com/8e096ec0-316c-11e5-8de8-f215e10b51f4.jpg","url":"http://jobs.github.com/positions/628817aa-316d-11e5-9473-8e33a6061b22"},{"id":"9d6bef1e-2bf9-11e5-951c-0d5a910bba9b","created_at":"Thu Jul 16 20:32:59 UTC 2015","title":"Senior Ruby on Rails Developer","location":"Boulder, CO","type":"Full Time","description":"<p>Based in Boulder, Colorado, Mondo Robot is a multidisciplinary team of digital artisans that bring together passion, collaboration, and creativity to create high-concept digital solutions that are innovative, engaging, and results-driven. We rock websites, games, strategy, bikes, motion, tequila, video, code, logos, tacos, mobile, music, new identities, IPA’s and sweet Colorado pow.  Not to mention, we’re a hell of a lot of fun to work with.</p>\n\n<p>Outside of being an outstanding developer, you must have strong communication skills, be extremely passionate, have the ability to manage multiple projects, and enjoy working closely with designers, producers and other developers.  You’ll be creating world-class digital experiences that incorporate the latest industry technologies. Additionally, you will work closely with creatives to innovate and push boundaries, create prototypes to support concepts, participate in code reviews, mentor developers, and pair program.</p>\n\n<p>WHAT WE’D LIKE TO SEE</p>\n\n<ul>\n<li>5+ years experience of full stack Web development using Ruby on Rails, JavaScript, HTML5 and CSS3</li>\n<li>A high level of proficiency creating interactive Web applications</li>\n<li>Deep understanding of coding best practices including MVC, object-oriented principles, and design patterns with a focus on performance and scalability</li>\n<li>The desire to work on a diverse range of challenging projects and an inclination to contribute to the creative process</li>\n<li>Experience with Sidekiq, Redis, PostgreSQL</li>\n<li>Experience building RESTful APIs backed by unit tests and QA testing tools </li>\n<li>History working with at least one major JavaScript MVC such as Backbone, Angular, or Ember</li>\n<li>Advanced Git (branches, submodules, rebasing) </li>\n</ul>\n\n<p>BONUS:</p>\n\n<ul>\n<li>Experience with alternative programming environment such as PHP, Node.js, Python, .NET, Java, or equivalent</li>\n<li>Experience with NoSQL (MongoDB preferred)</li>\n<li>DevOps using Amazon Web Services and/or Heroku</li>\n<li>Agile methodologies like Scrum and/or Extreme Programming</li>\n</ul>\n\n<p>Please submit your resume to <a href=\"mailto:jobs@mondorobot.com\">jobs@mondorobot.com</a>.</p>\n\n<p>Mondo Robot is an equal opportunity employer (EOE). We strongly support diversity in the workforce.</p>\n","how_to_apply":"<p>Please submit your resume to <a href=\"mailto:jobs@mondorobot.com\">jobs@mondorobot.com</a>.</p>\n","company":"Mondo Robot","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/44bdfd8a-2bf9-11e5-947f-bc887384191b.jpg","url":"http://jobs.github.com/positions/9d6bef1e-2bf9-11e5-951c-0d5a910bba9b"},{"id":"f7e26f9e-2a51-11e5-95d0-c5ea49d45bf0","created_at":"Tue Jul 14 17:59:33 UTC 2015","title":"Senior Software Engineer – JavaScript","location":"Englewood, CO","type":"Full Time","description":"<p>IHS is the leading source of information and insight in pivotal areas that shape today’s business landscape: energy, economics, geopolitical risk, sustainability and supply chain management. Businesses and governments around the globe rely on our comprehensive content, expert independent analysis and flexible delivery methods to make high-impact decisions and develop strategies with speed and confidence. IHS was founded in 1959 and is headquartered in Englewood, Colorado, USA. Trusted by clients for more than 50 years, IHS employs more than 9000+ people in 32 countries. We serve 80 percent of the Global Fortune 500 as well as businesses and governments in 165 countries. </p>\n\n<p>General Job Duties<br>\nCandidate is a web application developer experienced in building full-featured Internet applications based on AngularJS JavaScript framework.  Candidates in this position work as part of a fast-paced project team to develop and deliver commercial software products for internal and external use.  Candidate will possess a professional working knowledge of the following technologies:  AngularJS, HTML, JavaScript, CSS, REST, JSON, and Web Services. Candidate has knowledge across a spectrum of programming languages and techniques, applies both current and new technologies in developing solutions. Must be an energetic &#39;self-starter&#39; who thrives in a continually changing environment with the ability to take ownership and be accountable for deliverables.</p>\n\n<p>Education/Experience Requirements</p>\n\n<ul>\n<li>Professional experience in front-end development using Object-Oriented JavaScript and MVVM Patterns using libraries such as AngularJS, Knockout, Backbone, Node.js and/or jQuery.</li>\n<li>Professional experience in applying async REST APIs and JSON services.</li>\n<li>Highly versed in HTML5 and CSS technologies (including CSS libraries like Bootstrap)</li>\n<li>At least 5 years’ experience developing JavaScript web-based applications along with 5 years of prior development experience.</li>\n<li>Experience with cross-browser optimization (Internet Explorer, Chrome, Firefox, and Safari).</li>\n<li>Degree in Computer Science, related field or equivalent experience.</li>\n<li>Demonstrated ability to create a software design and develop software based on an agreed upon architecture</li>\n<li>Must be able to effectively communicate technical information to both technical and non-technical personnel.</li>\n<li>Professional certification as warranted.</li>\n</ul>\n","how_to_apply":"<p>Learn More About This Opportunity and Apply Online at:\n<a href=\"https://jobs.ihs.com/job/US%2CCO%2CEnglewood%2C15-Inverness-W-Sr_-Software-Engineer-JavaScript-CO-80110/275780600/\">https://jobs.ihs.com/job/US%2CCO%2CEnglewood%2C15-Inverness-W-Sr_-Software-Engineer-JavaScript-CO-80110/275780600/</a></p>\n","company":"IHS","company_url":"https://www.ihs.com/about/careers.html","company_logo":"http://github-jobs.s3.amazonaws.com/eaada74e-2a51-11e5-9b49-922a1eaec680.png","url":"http://jobs.github.com/positions/f7e26f9e-2a51-11e5-95d0-c5ea49d45bf0"},{"id":"b951f0ec-2a51-11e5-984a-93b547b2bf65","created_at":"Tue Jul 14 17:57:38 UTC 2015","title":"Principal Software Engineer","location":"Englewood, CO","type":"Full Time","description":"<p>IHS is the leading source of information and insight in pivotal areas that shape today’s business landscape: energy, economics, geopolitical risk, sustainability and supply chain management. Businesses and governments around the globe rely on our comprehensive content, expert independent analysis and flexible delivery methods to make high-impact decisions and develop strategies with speed and confidence. IHS was founded in 1959 and is headquartered in Englewood, Colorado, USA. Trusted by clients for more than 50 years, IHS employs more than 9000+ people in 32 countries. We serve 80 percent of the Global Fortune 500 as well as businesses and governments in 165 countries. </p>\n\n<p>General Job Duties\nThe Principal Software Engineer is engaged with development, IT and project owner teams to build strategic architectures and frameworks to tackle complex business initiatives and deliver global commercial software releases. \nCandidate is passionate about exploiting multiple languages and programming techniques across products, frameworks and api layers ‘using the right tool for the right job’ to address fast-paced business requirements while insuring development team alignment.\nCandidate is actively engaged with the delivery teams thru hands-on, energetic and positive participation to establish coding and deployment practices and quality standards. </p>\n\n<p>Education / Experience Requirements</p>\n\n<ul>\n<li>12 or more years of increasing responsibility in technical roles, with 5 or more years of experience in guiding a development team.</li>\n<li>Experience in Agile SCRUM project management methodologies.</li>\n<li>Demonstrated knowledge in applying REST-based API frameworks to large scale, high traffic web services.</li>\n<li>Deep technical expertise in the Enterprise Java development. (J2EE, Spring, Tomcat, JBOSS, Struts, Maven, etc.)</li>\n<li>Experience with Microsoft .NET stack and/or other technology stack is a plus.</li>\n<li>Ability and passion to pick up new technologies and stay on the leading edge of full-stack development.</li>\n<li>Ability to translate disparate business strategies into comprehensive, pragmatic technology strategies and execution plans (roadmaps) to satisfy business strategy.</li>\n<li>Master’s degree in Computer Science, Engineering, or related discipline or equivalent experience.</li>\n</ul>\n","how_to_apply":"<p>Learn More About This Opportunity and Apply Online at:\n<a href=\"https://jobs.ihs.com/job/US%2CCO%2CEnglewood%2C15-Inverness-W-Principal-Software-Engineer-CO-80110/275808500/\">https://jobs.ihs.com/job/US%2CCO%2CEnglewood%2C15-Inverness-W-Principal-Software-Engineer-CO-80110/275808500/</a></p>\n","company":"IHS","company_url":"https://www.ihs.com/about/careers.html","company_logo":"http://github-jobs.s3.amazonaws.com/b3f7a736-2a51-11e5-976b-3849bd6d08b0.png","url":"http://jobs.github.com/positions/b951f0ec-2a51-11e5-984a-93b547b2bf65"},{"id":"071dd76a-202e-11e5-840d-50e7478adafb","created_at":"Wed Jul 01 20:20:21 UTC 2015","title":"Senior Ruby Developer","location":"Boulder","type":"Full Time","description":"<p>Are you a dedicated, pragmatic programmer, with a love for emerging technology and solving problems?  Does working for a toy company with robots and mobile games sound like a dream come true? Pinch yourself because that dream could be your reality here at Sphero (sphero.com).</p>\n\n<p>This is a unique opportunity for a talented and experienced full stack developer to join a revolutionary company that has been on Outside Magazine’s 100 Best Places To Work for two years in a row (ranked #3 in 2014) and was listed in Fast Company’s Top 10 Most Innovative Companies in Consumer Electronics.</p>\n\n<p>As a Senior Ruby Developer at Sphero, you will be working with a small team to implement highly performant, scalable web applications primarily in Ruby.  Although Ruby is the primary language our app is built in, we are technology agnostic and want you to choose the best tech for the job. You should have several years experience developing enterprise level web applications using test-driven or behavior-driven development methodologies. You must have an excellent understanding of relational databases and data-modeling techniques, and of course a deep knowledge of Ruby and Ruby on Rails.</p>\n\n<p>What You’ll Be Doing</p>\n\n<p>*Architecting, implementing, and maintaining, high-availability web applications and custom APIs.\n*Developing, applying or improving on ETL techniques for our reporting and analytic products.\n*Maintaining, improving, and monitoring the system that receives order information from our online store(s)</p>\n\n<p>What Experience and Attributes We’d Like You to Have</p>\n\n<p>*Expert knowledge of Ruby\n*Experience with modern software frameworks like Ruby on Rails\n*Deep love for testing of all forms (Unit, Spec, BDD etc.)\n*Proficiency in the use of GIT and SVN.\n*Strong collaboration skills.\n*Working knowledge of deploying and maintaining applications in distributed SaaS environments, their related technologies (EC2, EMR, S3, Redshift, Cloudfront, and RDS).\n*Experience with modern JavaScript frameworks especially JQuery and AngularJS</p>\n\n<p>Along with your application please include the following information:</p>\n\n<p>*Examples of your work in production\n*Links to any open source code you have released on github or elsewhere (if applicable)\n*Links to your blog, twitter feed or portfolio (if applicable)</p>\n\n<p>Why Sphero?</p>\n\n<p>One of the really great things about Sphero is that there is a tremendous opportunity to build important things that make our company better.  Have a cool idea for an internal app?  Want to implement a neat customer-facing feature? Your ideas can change the way thousands and thousands of people play.  This is an opportunity to be part of a cutting edge organization that has just scratched the surface of what connected toys can and will be. We’d love for you to be part of it.</p>\n\n<p>EEO</p>\n","how_to_apply":"<p><a href=\"https://orbotix.applytojob.com/apply/6LofEP/Senior-Ruby-Developer.html?source=GitHub\">https://orbotix.applytojob.com/apply/6LofEP/Senior-Ruby-Developer.html?source=GitHub</a></p>\n","company":"Sphero","company_url":"http://www.sphero.com","company_logo":"http://github-jobs.s3.amazonaws.com/289edc50-1f6a-11e5-93ba-4730f88cc64a.png","url":"http://jobs.github.com/positions/071dd76a-202e-11e5-840d-50e7478adafb"}]